{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "Hi",
        "Is anyone there?",
        "Hello",
        "Good day",
        "Whats up"
      ],
      "responses": [
        "Hello Im TInY how can I help you?",
        "Hi, I'm TInY im here to inform you ",
        "Hello how can I help you?"
      ],
      "context_set": ""
    },
    {
      "tag": "how are you",
      "patterns": [
        "how are you?",
        "How are you doing",
        "How are you going",
        "What's up?"
      ],
      "responses": [
        "Great to see you here!",
        "I'm fine thanks.",
        "I'm great"
      ],
      "context_set": ""
    },
    {
      "tag": "Goodmoringand evening",
      "patterns": [
        "Good morning",
        "Good evening",
        "Good afternoon"
      ],
      "responses": [
        "Good day to you.",
        "Good day how can I help you?"
      ],
      "context_set": ""
    },
    {
      "tag": "goodbye",
      "patterns": [
        "cya",
        "See you later",
        "Goodbye",
        "I am Leaving",
        "Have a Good day",
        "Bye"
      ],
      "responses": [
        "Goodbye and Thank you",
        "Nice talking with you, Goodbye!",
        "Have a great day!"
      ],
      "context_set": ""
    },
    {
      "tag": "name",
      "patterns": [
        "what is your name",
        "what should I call you",
        "whats your name?"
      ],
      "responses": [
        "My name is TInY",
        "I'm TInY!",
        "I'm TInY, here To INform You",
        "Hi, I'm TInY!"
      ],
      "context_set": ""
    },
    {
      "tag": "okay",
      "patterns": [
        "okay",
        "ok",
        "oks",
        "nice",
        "wow",
        "Yes"
      ],
      "responses": [
        "Let me know if you have any question!",
        "Be sure to ask if you have any other questions!"
      ],
      "context_set": ""
    },
    {
      "tag": "robot",
      "patterns": [
        "are you a robot?",
        "you are robot?",
        "are you a bot",
        "are you a chatbot",
        "are you human",
        "is im talking with a bot?",
        "is im talking with a human?"
      ],
      "responses": [
        "I'm a Artificial intelligence bot programmed to answer only some of the frequent questions on the BulSU website and some of the questions about the campus.",
        "Yes I am a robot, but I’m a good one. Let me prove it. How can I help you?"
      ],
      "context_set": ""
    },
    {
      "tag": "bday",
      "patterns": [
        "when is your birthday",
        "your birthday",
        "your birthday is on?",
        "do you have birthday",
        "your birth date"
      ],
      "responses": [
        "My birthday is Nov 20, 2020. It is the day that my developer created the first version of me"
      ],
      "context_set": ""
    },
    {
      "tag": "questionnnn",
      "patterns": [
        "i have question",
        "can i ask you a question?",
        "i have question to you",
        "can you help me"
      ],
      "responses": [
        "What is that?",
        "Yes what is that?"
      ],
      "context_set": ""
    },
    {
      "tag": "human talk",
      "patterns": [
        "i want to talk to human",
        "Can i speak with a person",
        "Can i speak with a human",
        "i need to talk with a real person",
        "i need to talk with human",
        "i need to talk with person",
        "i dont want to talk with a bot",
        "i dont want to talk with a chatbot",
        "i dont want to talk with a robot"
      ],
      "responses": [
        "I am here to do the talking, but if you wish to speak to a person let me know what department you want to contact."
      ],
      "context_set": ""
    },
    {
      "tag": "bulsu_president",
      "database": "executives",
      "patterns": [
        "Who is the President of Bulacan State University?",
        "University President",
        "Bulacan State University President",
        "Current President of Bulacan State University",
        "Who is the President of BulSU?",
        "BulSU President",
        "Current President of BulSU",
        "What is the name of bulsu president?",
        "name of the president of bulsu",
        "What is the name of Bulacan state university president?",
        "name of the president of Bulacan state university"
      ],
      "responses": [
        "executives^president"
      ],
      "context_set": ""
    },
    {
      "tag": "Executive Vice President",
      "database": "executives",
      "patterns": [
        "Who is the Executive Vice President of Bulacan State University?",
        "University Executive Vice President",
        "Bulacan State University Executive Vice President",
        "Current Executive Vice President of Bulacan State University",
        "Who is the Executive Vice President of BulSU?",
        "BulSU Executive Vice President",
        "Current Executive Vice President of BulSU",
        "What is the name of bulsu Executive Vice President",
        "name of the Executive Vice President of bulsu",
        "What is the name of Bulacan state university Executive Vice President?",
        "name of the Executive Vice President of Bulacan state university"
      ],
      "responses": [
        "executives^Executive Vice President"
      ],
      "context_set": ""
    },
    {
      "tag": "Vice President for Research",
      "database": "executives",
      "patterns": [
        "Who is the Vice President for Research, Development and Extension of Bulacan State University?",
        "University Vice President for Research, Development and Extension",
        "Bulacan State University Vice President for Research, Development and Extension",
        "Current Vice President for Research, Development and Extension of Bulacan State University",
        "Who is the Vice President for Research, Development and Extension of BulSU?",
        "BulSU Vice President for Research, Development and Extension",
        "Current Vice President for Research, Development and Extension of BulSU",
        "What is the name of bulsu Vice President for Research, Development and Extension?",
        "name of the Vice President for Research, Development and Extension of bulsu",
        "What is the name of Bulacan state university Vice President for Research, Development and Extension?",
        "name of the Vice President for Research, Development and Extension of Bulacan state university"
      ],
      "responses": [
        "executives^Vice President for Research"
      ],
      "context_set": ""
    },
    {
      "tag": "Vice President for Administration and Finance",
      "database": "executives",
      "patterns": [
        "Who is the Vice President for Administration and Finance of Bulacan State University?",
        "University Vice President for Administration and Finance",
        "Bulacan State University Vice President for Administration and Finance",
        "Current Vice President for Administration and Finance of Bulacan State University",
        "Who is the Vice President for Administration and Finance of BulSU?",
        "BulSU Vice President for Administration and Finance",
        "Current Vice President for Administration and Finance of BulSU",
        "What is the name of bulsu Vice President for Administration and Finance?",
        "name of the Vice President for Administration and Finance of bulsu",
        "What is the name of Bulacan state university Vice President for Administration and Finance?",
        "name of the Vice President for Administration and Finance of Bulacan state university"
      ],
      "responses": [
        "executives^Vice President for Administration and Finance"
      ],
      "context_set": ""
    },
    {
      "tag": "Vice President for Academic Affairs",
      "database": "executives",
      "patterns": [
        "Who is the Vice President for Academic Affairs of Bulacan State University?",
        "Bulacan State University Vice President for Academic Affairs",
        "Current Vice President for Academic Affairs of Bulacan State University",
        "Who is the Vice President for Academic Affairs of BulSU?",
        "University Vice President for Academic Affairs",
        "BulSU Vice President for Academic Affairs",
        "Current Vice President for Academic Affairs of BulSU",
        "What is the name of bulsu Vice President for Academic Affairs?",
        "name of the Vice President for Academic Affairs of bulsu",
        "What is the name of Bulacan state university Vice President for Academic Affairs?",
        "name of the Vice President for Academic Affairs of Bulacan state university"
      ],
      "responses": [
        "executives^Vice President for Academic Affairs"
      ],
      "context_set": ""
    },
    {
      "tag": "dean of graduate school",
      "database": "deans",
      "patterns": [
        "Who is the dean of graduate school?",
        "Graduate school dean",
        "Dean of graduate school",
        "current dean of graduate school",
        "what is the name of the dean of  graduate school?",
        "Name of  graduate school dean?",
        "dean of  graduate school name?",
        "What is the deans name of  graduate school",
        "graduate school deans name?",
        "Do you know who is the dean of  graduate school"
      ],
      "responses": [
        "deans^graduate school"
      ],
      "context_set": ""
    },
    {
      "tag": "dean of College of Architecture and Fine Arts",
      "database": "deans",
      "patterns": [
        "Who is the dean of College of Architecture and Fine Arts?",
        "College of Architecture and Fine Arts dean",
        "Dean of College of Architecture and Fine Arts",
        "current dean of College of Architecture and Fine Arts",
        "Who is the dean of CAFA?",
        "CAFA dean",
        "Dean of CAFA",
        "Current dean of CAFA",
        "what is the name of the dean of College of Architecture and Fine Arts?",
        "what is the name of the dean of CAFA?",
        "Name of College of Architecture and Fine Arts dean?",
        "Name of CAFA dean?",
        "dean of College of Architecture and Fine Arts name?",
        "dean of CAFA name?",
        "What is the deans name of College of Architecture and Fine Arts",
        "What is the deans name of CAFA",
        "College of Architecture and Fine Arts deans name?",
        "CAFA deans name?",
        "Do you know who is the dean of College of Architecture and Fine Arts",
        "Do you know who is the dean of CAFA"
      ],
      "responses": [
        "deans^CAFA"
      ],
      "context_set": ""
    },
    {
      "tag": "dean of College of Arts and Letters",
      "database": "deans",
      "patterns": [
        "Who is the dean of College of Arts and Letters?",
        "College of Arts and Letters dean",
        "Dean of College of Arts and Letters",
        "Current dean of College of Arts and Letters",
        "Who is the dean of CAL?",
        "CAL dean",
        "Dean of CAL",
        "Current dean of CAL",
        "what is the name of the dean of College of Arts and Letters?",
        "what is the name of the dean of CAL?",
        "Name of College of Arts and Letters dean?",
        "Name of CAL dean?",
        "dean of College of Arts and Letters name?",
        "dean of CAL name?",
        "What is the deans name of College of Arts and Letters",
        "What is the deans name of CAL",
        "College of Arts and Letters deans name?",
        "CAL deans name?",
        "Do you know who is the dean of College of Arts and Letters",
        "Do you know who is the dean of CAL"
      ],
      "responses": [
        "deans^CAL"
      ],
      "context_set": ""
    },
    {
      "tag": "dean of College of Business Administration",
      "database": "deans",
      "patterns": [
        "Who is the dean of College of Business Administration?",
        "College of Business Administration dean",
        "Dean of College of Business Administration",
        "Current dean of College of Business Administration",
        "Who is the dean of CBA?",
        "CBA dean",
        "Dean of CBA",
        "Current dean of CBA",
        "what is the name of the dean of College of Business Administration?",
        "what is the name of the dean of CBA?",
        "Name of College of Business Administration dean?",
        "Name of CBA dean?",
        "dean of College of Business Administration name?",
        "dean of CBA name?",
        "What is the deans name of College of Business Administration",
        "What is the deans name of CBA",
        "College of Business Administration deans name?",
        "CBA deans name?",
        "Do you know who is the dean of College of Business Administration",
        "Do you know who is the dean of CBA"
      ],
      "responses": [
        "deans^CBA"
      ],
      "context_set": ""
    },
    {
      "tag": "dean of College of Criminal Justice Education",
      "database": "deans",
      "patterns": [
        "Who is the dean of College of Criminal Justice Education?",
        "College of Criminal Justice Education dean",
        "Dean of College of Criminal Justice Education",
        "Current dean of College of Criminal Justice Education",
        "Who is the dean of CCJE?",
        "CCJE dean",
        "Dean of CCJE",
        "Current dean of CCJE",
        "what is the name of the dean of College of Criminal Justice Education?",
        "what is the name of the dean of CCJE?",
        "Name of College of Criminal Justice Education dean?",
        "Name of CCJE dean?",
        "dean of College of Criminal Justice Education name?",
        "dean of CCJE name?",
        "What is the deans name of College of Criminal Justice Education",
        "What is the deans name of CCJE",
        "College of Criminal Justice Education deans name?",
        "CCJE deans name?",
        "Do you know who is the dean of College of Criminal Justice Education",
        "Do you know who is the dean of CCJE"
      ],
      "responses": [
        "deans^CCJE"
      ],
      "context_set": ""
    },
    {
      "tag": "dean of College of Hospitality and Tourism Management",
      "database": "deans",
      "patterns": [
        "Who is the dean of College of Hospitality and Tourism Management?",
        "College of Hospitality and Tourism Management dean",
        "Dean of College of Hospitality and Tourism Management",
        "Current dean of College of Hospitality and Tourism Management",
        "Who is the dean of CHTM?",
        "CHTM dean",
        "Dean of CHTM",
        "Current dean of CHTM",
        "what is the name of the dean of College of Hospitality and Tourism Management?",
        "what is the name of the dean of CHTM?",
        "Name of College of Hospitality and Tourism Management dean?",
        "Name of CHTM dean?",
        "dean of College of Hospitality and Tourism Management name?",
        "dean of CHTM name?",
        "What is the deans name of College of Hospitality and Tourism Management",
        "What is the deans name of CHTM",
        "College of Hospitality and Tourism Management deans name?",
        "CHTM deans name?",
        "Do you know who is the dean of College of Hospitality and Tourism Management",
        "Do you know who is the dean of CHTM"
      ],
      "responses": [
        "deans^CHTM"
      ],
      "context_set": ""
    },
    {
      "tag": "dean of College of Information and Communications Technology",
      "database": "deans",
      "patterns": [
        "Who is the dean of College of Information and Communications Technology?",
        "College of Information and Communications Technology dean",
        "Dean of College of Information and Communications Technology",
        "Current dean of College of Information and Communications Technology",
        "Who is the dean of CICT?",
        "CICT dean",
        "Dean of CICT",
        "Current dean of CICT",
        "what is the name of the dean of College of Information and Communications Technology?",
        "what is the name of the dean of CICT?",
        "Name of College of Information and Communications Technology dean?",
        "Name of CICT dean?",
        "dean of College of Information and Communications Technology name?",
        "dean of CICT name?",
        "What is the deans name of College of Information and Communications Technology",
        "What is the deans name of CICT",
        "College of Information and Communications Technology deans name?",
        "CICT deans name?",
        "Do you know who is the dean of College of Information and Communications Technology",
        "Do you know who is the dean of CICT"
      ],
      "responses": [
        "deans^CICT"
      ],
      "context_set": ""
    },
    {
      "tag": "dean of College of Industrial Technology",
      "database": "deans",
      "patterns": [
        "Who is the dean of College of Industrial Technology?",
        "College of Industrial Technology dean",
        "Dean of College of Industrial Technology",
        "Current dean of College of Industrial Technology",
        "Who is the dean of CIT?",
        "CIT dean",
        "Dean of CIT",
        "Current dean of CIT",
        "what is the name of the dean of College of Industrial Technology?",
        "what is the name of the dean of CIT?",
        "Name of College of Industrial Technology dean?",
        "Name of CIT dean?",
        "dean of College of Industrial Technology name?",
        "dean of CIT name?",
        "What is the deans name of College of Industrial Technology",
        "What is the deans name of CIT",
        "College of Industrial Technology deans name?",
        "CIT deans name?",
        "Do you know who is the dean of College of Industrial Technology",
        "Do you know who is the dean of CIT"
      ],
      "responses": [
        "deans^CIT"
      ],
      "context_set": ""
    },
    {
      "tag": "dean of College of Law",
      "database": "deans",
      "patterns": [
        "Who is the dean of College of Law?",
        "College of Law dean",
        "Dean of College of Law",
        "Current dean of College of Law",
        "Who is the dean of CLaw?",
        "CLaw dean",
        "Dean of CLaw",
        "Current dean of CLaw",
        "what is the name of the dean of College of Law?",
        "what is the name of the dean of CLaw?",
        "Name of College of Law dean?",
        "Name of CLaw dean?",
        "dean of College of Law name?",
        "dean of CLaw name?",
        "What is the deans name of College of Law",
        "What is the deans name of CLaw",
        "College of Law deans name?",
        "CLaw deans name?",
        "Do you know who is the dean of College of Law",
        "Do you know who is the dean of CLaw"
      ],
      "responses": [
        "deans^CLaw"
      ],
      "context_set": ""
    },
    {
      "tag": "dean of College of Nursing",
      "database": "deans",
      "patterns": [
        "Who is the dean of College of Nursing?",
        "College of Nursing dean",
        "Dean of College of Nursing",
        "Current dean of College of Nursing",
        "Who is the dean of CON?",
        "CON dean",
        "Dean of CON",
        "Current dean of CON",
        "what is the name of the dean of College of Nursing?",
        "what is the name of the dean of CON?",
        "Name of College of Nursing dean?",
        "Name of CON dean?",
        "dean of College of Nursing name?",
        "dean of CON name?",
        "What is the deans name of College of Nursing",
        "What is the deans name of CON",
        "College of Nursing deans name?",
        "CON deans name?",
        "Do you know who is the dean of College of Nursing",
        "Do you know who is the dean of CON"
      ],
      "responses": [
        "deans^CON"
      ],
      "context_set": ""
    },
    {
      "tag": "dean of College of Engineering",
      "database": "deans",
      "patterns": [
        "Who is the dean of College of Engineering?",
        "College of Engineering dean",
        "Dean of College of Engineering",
        "Current dean of College of Engineering",
        "Who is the dean of COE?",
        "COE dean",
        "Dean of COE",
        "Current dean of COE",
        "what is the name of the dean of College of Engineering?",
        "what is the name of the dean of COE?",
        "Name of College of Engineering dean?",
        "Name of COE dean?",
        "dean of College of Engineering name?",
        "dean of COE name?",
        "What is the deans name of College of Engineering",
        "What is the deans name of COE",
        "College of Engineering deans name?",
        "COE deans name?",
        "Do you know who is the dean of College of Engineering",
        "Do you know who is the dean of COE"
      ],
      "responses": [
        "deans^COE"
      ],
      "context_set": ""
    },
    {
      "tag": "dean of College of Education",
      "database": "deans",
      "patterns": [
        "Who is the dean of College of Education?",
        "College of Education dean",
        "Dean of College of Education",
        "Current dean of College of Education",
        "Who is the dean of COED?",
        "COED dean",
        "Dean of COED",
        "Current dean of COED",
        "what is the name of the dean of College of Education?",
        "what is the name of the dean of COED?",
        "Name of College of Education dean?",
        "Name of COED dean?",
        "dean of College of Education name?",
        "dean of COED name?",
        "What is the deans name of College of Education",
        "What is the deans name of COED",
        "College of Education deans name?",
        "COED deans name?",
        "Do you know who is the dean of College of Education",
        "Do you know who is the dean of COED"
      ],
      "responses": [
        "deans^COED"
      ],
      "context_set": ""
    },
    {
      "tag": "dean of College of Science",
      "database": "deans",
      "patterns": [
        "Who is the dean of College of Science?",
        "College of Science dean",
        "Dean of College of Science",
        "Current dean of College of Science",
        "Who is the dean of CS?",
        "CS dean",
        "Dean of CS",
        "Current dean of CS",
        "what is the name of the dean of College of Science?",
        "what is the name of the dean of CS?",
        "Name of College of Science dean?",
        "Name of CS dean?",
        "dean of College of Science name?",
        "dean of CS name?",
        "What is the deans name of College of Science",
        "What is the deans name of CS",
        "College of Science deans name?",
        "CS deans name?",
        "Do you know who is the dean of College of Science",
        "Do you know who is the dean of CS"
      ],
      "responses": [
        "deans^CS"
      ],
      "context_set": ""
    },
    {
      "tag": "dean of College of Sports, Exercise and Recreation",
      "database": "deans",
      "patterns": [
        "Who is the dean of College of Sports, Exercise and Recreation?",
        "College of Sports, Exercise and Recreation dean",
        "Dean of College of Sports, Exercise and Recreation",
        "Current dean of College of Sports, Exercise and Recreation",
        "Who is the dean of CSER?",
        "CSER dean",
        "Dean of CSER",
        "Current dean of CSER",
        "what is the name of the dean of College of Sports, Exercise and Recreation?",
        "what is the name of the dean of CSER?",
        "Name of College of Sports, Exercise and Recreation dean?",
        "Name of CSER dean?",
        "dean of College of Sports, Exercise and Recreation name?",
        "dean of CSER name?",
        "What is the deans name of College of Sports, Exercise and Recreation",
        "What is the deans name of CSER",
        "College of Sports, Exercise and Recreation deans name?",
        "CSER deans name?",
        "Do you know who is the dean of College of Sports, Exercise and Recreation",
        "Do you know who is the dean of CSER"
      ],
      "responses": [
        "deans^CSER"
      ],
      "context_set": ""
    },
    {
      "tag": "dean of College of Social Sciences and Philosophy",
      "database": "deans",
      "patterns": [
        "Who is the dean of College of Social Sciences and Philosophy?",
        "College of Social Sciences and Philosophy dean",
        "Dean of College of Social Sciences and Philosophy",
        "Current dean of College of Social Sciences and Philosophy",
        "Who is the dean of CSSP?",
        "CSSP dean",
        "Dean of CSSP",
        "Current dean of CSSP",
        "what is the name of the dean of College of Social Sciences and Philosophy?",
        "what is the name of the dean of CSSP?",
        "Name of College of Social Sciences and Philosophy dean?",
        "Name of CSSP dean?",
        "dean of College of Social Sciences and Philosophy name?",
        "dean of CSSP name?",
        "What is the deans name of College of Social Sciences and Philosophy",
        "What is the deans name of CSSP",
        "College of Social Sciences and Philosophy deans name?",
        "CSSP deans name?",
        "Do you know who is the dean of College of Social Sciences and Philosophy",
        "Do you know who is the dean of CSSP"
      ],
      "responses": [
        "deans^CSSP"
      ],
      "context_set": ""
    },
    {
      "tag": "Location of CSSP",
      "patterns": [
        "What building was College of Social Science and Psychology located?",
        "Where is the Location of College of Social Science and Psychology?",
        "College of Social Science and Psychology main location",
        "College of Social Science and Psychology location",
        "Location of College of Social Science and Psychology",
        "Where can i find the College of Social Science and Psychology?",
        "Where can i locate the College of Social Science and Psychology?",
        "College of Social Science and Psychology building",
        "What building was CSSP located?",
        "Location of CSSP",
        "Where is the location of CSSP",
        "Where can i find the CSSP?",
        "Where can i locate the CSSP?",          
        "building of CSSP",
        "CSSP building",
        "CSSP location",
        "how can i find the College of Social Science and Psychology?",
        "how can i find the CSSP?",
        "Do you know where is the College of Social Science and Psychology?",
        "Do you know where is the CSSP?",
        "Where is the exact location of College of Social Science and Psychology building",
        "Where is the exact location of CSSP building"
      ],
      "responses": [
        "The College of Social Science and Psychology (CSSP) is located in front of the BulSU's 4th gate. This building is named Mendoza Hall."
      ],
      "context_set": ""
    },
    {
      "tag": "Location of CSER",
      "patterns": [
        "What building was College of Sports, Exercise and Recreation located?",
        "Where is the Location of College of Sports, Exercise and Recreation?",
        "College of Sports, Exercise and Recreation main location",
        "College of Sports, Exercise and Recreation location",
        "Location of College of Sports, Exercise and Recreation",
        "Where can i find the College of Sports, Exercise and Recreation?",
        "Where can i locate the College of Sports, Exercise and Recreation?",
        "College of Sports, Exercise and Recreation building",
        "What building was CSER located?",
        "Location of CSER",
        "Where can i find the CSER?",
        "Where is the location of CSER",
        "Where can i locate the CSER?",          
        "building of CSER",
        "CSER building",
        "CSER location",
        "how can i find the College of Sports, Exercise and Recreation?",
        "how can i find the CSER?",
        "Do you know where is the College of Sports, Exercise and Recreation?",
        "Do you know where is the CSER?",
        "Where is the exact location of College of Sports, Exercise and Recreation building",
        "Where is the exact location of CSER building"
      ],
      "responses": [
        "The College of Sports, Exercise and Recreation (CSER) is located in Chess Institute in front of Federizo Hall."
      ],
      "context_set": ""
    },
    {
      "tag": "Location of LAB HIGH",
      "patterns": [
        "What building was LABORATORY HIGH SCHOOL located?",
        "Where is the Location of LABORATORY HIGH SCHOOL?",
        "LABORATORY HIGH SCHOOL main location",
        "LABORATORY HIGH SCHOOL location",
        "Location of LABORATORY HIGH SCHOOL",
        "Where can i find the LABORATORY HIGH SCHOOL?",
        "Where can i locate the LABORATORY HIGH SCHOOL?",
        "LABORATORY HIGH SCHOOL building",
        "What building was LAB HIGH located?",
        "Location of LAB HIGH",
        "Where can i find the LAB HIGH?",
        "Where is the location of LAB HIGH",
        "Where can i locate the LAB HIGH?",          
        "building of LAB HIGH",
        "LAB HIGH building",
        "LAB HIGH location",
        "how can i find the LABORATORY HIGH SCHOOL?",
        "how can i find the LAB HIGH?",
        "Do you know where is the LABORATORY HIGH SCHOOL?",
        "Do you know where is the LAB HIGH?",
        "Where is the exact location of LABORATORY HIGH SCHOOL building",
        "Where is the exact location of LAB HIGH building"
      ],
      "responses": [
        "The Laboratory Highschool building is located in front of BulSU Heroes Park and Roxas Hall. This building is named Carpio Hall."
      ],
      "context_set": ""
    },
    {
      "tag": "CCJE location",
      "patterns": [
        "What building was Criminal Justice Education located?",
        "Where is the Location of Criminal Justice Education?",
        "Criminal Justice Education main location",
        "Criminal Justice Education location",
        "Location of Criminal Justice Education",
        "Where can i find the Criminal Justice Education?",
        "Where can i locate the Criminal Justice Education?",
        "Criminal Justice Education building",
        "What building was CCJE located?",
        "Location of CCJE",
        "Where can i find the CCJE?",
        "Where is the location of CCJE",
        "Where can i locate the CCJE?",          
        "building of CCJE",
        "CCJE building",
        "CCJE location",
        "how can i find the Criminal Justice Education?",
        "how can i find the CCJE?",
        "Do you know where is the Criminal Justice Education?",
        "Do you know where is the CCJE?",
        "Where is the exact location of Criminal Justice Education building",
        "Where is the exact location of CCJE building"
      ],
      "responses": [
        "The College of Criminal Justice Education (CCJE) is located in front of the BulSU's 3rd gate."
      ],
      "context_set": ""
    },
    {
      "tag": "CHTM location",
      "patterns": [
        "What building was College of Hospitality and Tourism Management located?",
        "Where is the Location of College of Hospitality and Tourism Management?",
        "College of Hospitality and Tourism Management main location",
        "College of Hospitality and Tourism Management location",
        "Location of College of Hospitality and Tourism Management",
        "Where can i find the College of Hospitality and Tourism Management?",
        "Where can i locate the College of Hospitality and Tourism Management?",
        "College of Hospitality and Tourism Management building",
        "What building was CHTM located?",
        "Location of CHTM",
        "Where can i find the CHTM?",
        "Where is the location of CHTM",
        "Where can i locate the CHTM?",          
        "building of CHTM",
        "CHTM building",
        "CHTM location",
        "how can i find the College of Hospitality and Tourism Management?",
        "how can i find the CHTM?",
        "Do you know where is the College of Hospitality and Tourism Management?",
        "Do you know where is the CHTM?",
        "Where is the exact location of College of Hospitality and Tourism Management building",
        "Where is the exact location of CHTM building"
      ],
      "responses": [
        "The College of Hospitality and Tourism Management (CHTM) is located beside the BulSU hostel building."
      ],
      "context_set": ""
    },
    {
      "tag": "COED building",
      "patterns": [
        "What building was College of Education located?",
        "Where is the Location of College of Education?",
        "College of Education main location",
        "College of Education location",
        "Location of College of Education",
        "Where can i find the College of Education?",
        "Where can i locate the College of Education?",
        "College of Education building",
        "What building was COED located?",
        "Location of COED",
        "Where can i find the COED?",
        "Where is the location of COED",
        "Where can i locate the COED?",          
        "building of COED",
        "COED building",
        "COED location",
        "how can i find the College of Education?",
        "how can i find the COED?",
        "Do you know where is the College of Education?",
        "Do you know where is the COED?",
        "Where is the exact location of College of Education building",
        "Where is the exact location of COED building"
      ],
      "responses": [
        "The College of Education (COED) is located in front of BulSU Heroes Park. This building is named Roxas Hall."
      ],
      "context_set": ""
    },
    {
      "tag": "CAFA location",
      "patterns": [
        "What building was College of Architecture and Fine Arts located?",
        "Where is the Location of College of Architecture and Fine Arts?",
        "College of Architecture and Fine Arts main location",
        "College of Architecture and Fine Arts location",
        "Location of College of Architecture and Fine Arts",
        "Where can i find the College of Architecture and Fine Arts?",
        "Where can i locate the College of Architecture and Fine Arts?",
        "College of Architecture and Fine Arts building",
        "What building was CAFA located?",
        "Location of CAFA",
        "Where can i find the CAFA?",
        "Where is the location of CAFA",
        "Where can i locate the CAFA?",          
        "building of CAFA",
        "CAFA building",
        "CAFA location",
        "how can i find the College of Architecture and Fine Arts?",
        "how can i find the CAFA?",
        "Do you know where is the College of Architecture and Fine Arts?",
        "Do you know where is the CAFA?",
        "Where is the exact location of College of Architecture and Fine Arts building",
        "Where is the exact location of CAFA building"
      ],
      "responses": [
        "The College of Architecture and Fine Arts (CAFA) is located on the 3rd floor of Federizo Hall."
      ],
      "context_set": ""
    },
    {
      "tag": "CAL location",
      "patterns": [
        "What building was College of Arts and Letters located?",
        "Where is the Location of College of Arts and Letters?",
        "College of Arts and Letters main location",
        "College of Arts and Letters location",
        "Location of College of Arts and Letters",
        "Where can i find the College of Arts and Letters?",
        "Where can i locate the College of Arts and Letters?",
        "College of Arts and Letters building",
        "What building was CAL located?",
        "Location of CAL",
        "Where can i find the CAL?",
        "Where is the location of CAL",
        "Where can i locate the CAL?",          
        "building of CAL",
        "CAL building",
        "CAL location",
        "how can i find the College of Arts and Letters?",
        "how can i find the CAL?",
        "Do you know where is the College of Arts and Letters?",
        "Do you know where is the CAL?",
        "Where is the exact location of College of Arts and Letters building",
        "Where is the exact location of CAL building"
      ],
      "responses": [
        "The College of Arts and Letters (CAL) is located on the right ground floor and right side of the 2nd floor in Federizo Hall."
      ],
      "context_set": ""
    },
    {
      "tag": "CS building",
      "patterns": [
        "What building was College of Science located?",
        "Where is the Location of College of Science?",
        "College of Science main location",
        "College of Science location",
        "Location of College of Science",
        "Where can i find the College of Science?",
        "Where can i locate the College of Science?",
        "College of Science building",
        "What building was CS located?",
        "Location of CS",
        "Where can i find the CS?",
        "Where is the location of CS",
        "Where can i locate the CS?",          
        "building of CS",
        "CS building",
        "CS location",
        "how can i find the College of Science?",
        "how can i find the CS?",
        "Do you know where is the College of Science?",
        "Do you know where is the CS?",
        "Where is the exact location of College of Science building",
        "Where is the exact location of CS building"
      ],
      "responses": [
        "The College of Science (CS) is located on the left ground floor and left side of the 2nd floor in Federizo Hall and it is behind BulSU Heroes Park."
      ],
      "context_set": ""
    },
    {
      "tag": "COE location",
      "patterns": [
        "What building was College of Engineering located?",
        "Where is the Location of College of Engineering?",
        "College of Engineering main location",
        "College of Engineering location",
        "Location of College of Engineering",
        "Where can i find the College of Engineering?",
        "Where can i locate the College of Engineering?",
        "College of Engineering building",
        "What building was COE located?",
        "Location of COE",
        "Where can i find the COE?",
        "Where is the location of COE",
        "Where can i locate the COE?",          
        "building of COE",
        "COE building",
        "COE location",
        "how can i find the College of Engineering?",
        "how can i find the COE?",
        "Do you know where is the College of Engineering?",
        "Do you know where is the COE?",
        "Where is the exact location of College of Engineering building",
        "Where is the exact location of COE building"
      ],
      "responses": [
        "The College of Engineering (COE) building is located on the right side of BulSU Heroes Park. This building is named Natividad Hall."
      ],
      "context_set": ""
    },
    {
      "tag": "Location of CBA",
      "patterns": [
        "What building was College of Business Administration located?",
        "Where is the Location of College of Business Administration?",
        "College of Business Administration main location",
        "College of Business Administration location",
        "Location of College of Business Administration",
        "Where can i find the College of Business Administration?",
        "Where can i locate the College of Business Administration?",
        "College of Business Administration building",
        "What building was CBA located?",
        "Location of CBA",
        "Where can i find the CBA?",
        "Where is the location of CBA",
        "Where can i locate the CBA?",          
        "building of CBA",
        "CBA building",
        "CBA location",
        "how can i find the College of Business Administration?",
        "how can i find the CBA?",
        "Do you know where is the College of Business Administration?",
        "Do you know where is the CBA?",
        "Where is the exact location of College of Business Administration building",
        "Where is the exact location of CBA building"
      ],
      "responses": [
        "The College of Business Administration (CBA) building is located on the left side of BulSU Heroes Park."
      ],
      "context_set": ""
    },
    {
      "tag": "Location of CIT",
      "patterns": [
        "What building was College of industrial technology located?",
        "Where is the Location of College of industrial technology?",
        "College of industrial technology main location",
        "College of industrial technology location",
        "Location of College of industrial technology",
        "Where can i find the College of industrial technology?",
        "Where can i locate the College of industrial technology?",
        "College of industrial technology building",
        "What building was CIT located?",
        "Location of CIT",
        "Where can i find the CIT?",
        "Where is the location of CIT",
        "Where can i locate the CIT?",          
        "building of CIT",
        "CIT building",
        "CIT location",
        "how can i find the College of industrial technology?",
        "how can i find the CIT?",
        "Do you know where is the College of industrial technology?",
        "Do you know where is the CIT?",
        "Where is the exact location of College of industrial technology building",
        "Where is the exact location of CIT building"
      ],
      "responses": [
        "The College of Industrial Technology (CIT) is located after entering the main gate. This building is named Alvarado Hall."
      ],
      "context_set": ""
    },
    {
      "tag": "CLaw location",
      "patterns": [
        "What building was College of Law located?",
        "Where is the Location of College of Law?",
        "College of Law main location",
        "College of Law location",
        "Location of College of Law",
        "Where can i find the College of Law?",
        "Where can i locate the College of Law?",
        "College of Law building",
        "What building was CLaw located?",
        "Location of CLaw",
        "Where can i find the CLaw?",
        "Where is the location of CLaw",
        "Where can i locate the CLaw?",          
        "building of CLaw",
        "CLaw building",
        "CLaw location",
        "how can i find the College of Law?",
        "how can i find the CLaw?",
        "Do you know where is the College of Law?",
        "Do you know where is the CLaw?",
        "Where is the exact location of College of Law building",
        "Where is the exact location of CLaw building"
      ],
      "responses": [
        "The College of Law (CLaw) is located in front of Activity Center."
      ],
      "context_set": ""
    },
    {
      "tag": "CON location",
      "patterns": [
        "What building was College of Nursing located?",
        "Where is the Location of College of Nursing?",
        "College of Nursing main location",
        "College of Nursing location",
        "Location of College of Nursing",
        "Where can i find the College of Nursing?",
        "Where can i locate the College of Nursing?",
        "College of Nursing building",
        "What building was CON located?",
        "Location of CON",
        "Where can i find the CON?",
        "Where is the location of CON",
        "Where can i locate the CON?",          
        "building of CON",
        "CON building",
        "CON location",
        "how can i find the College of Nursing?",
        "how can i find the CON?",
        "Do you know where is the College of Nursing?",
        "Do you know where is the CON?",
        "Where is the exact location of College of Nursing building",
        "Where is the exact location of CON building"
      ],
      "responses": [
        "The College of Nursing (CON) is located on the ground floor and the 2nd floor of Pimentel Hall beside of Activity Center."
      ],
      "context_set": ""
    },
    {
      "tag": "CICT location",
      "patterns": [
        "What building was College of Information and Communication Technology located?",
        "Where is the Location of College of Information and Communication Technology?",
        "College of Information and Communication Technology main location",
        "College of Information and Communication Technology location",
        "Location of College of Information and Communication Technology",
        "Where can i find the College of Information and Communication Technology?",
        "Where can i locate the College of Information and Communication Technology?",
        "College of Information and Communication Technology building",
        "What building was CICT located?",
        "Location of CICT",
        "Where can i find the CICT?",
        "Where is the location of CICT",
        "Where can i locate the CICT?",          
        "building of CICT",
        "CICT building",
        "CICT location",
        "how can i find the College of Information and Communication Technology?",
        "how can i find the CICT?",
        "Do you know where is the College of Information and Communication Technology?",
        "Do you know where is the CICT?",
        "Where is the exact location of College of Information and Communication Technology building",
        "Where is the exact location of CICT building"
      ],
      "responses": [
        "The College of Information and Communication Technology (CICT) is located on the 3rd floor and 4th floor of Pimentel Hall beside of Activity Center."
      ],
      "context_set": ""
    },
    {
      "tag": "Main Address",
      "patterns": [      
        "Bulacan State University main address",
        "Bulsu Main Address?",
        "BulSU address",
        "Bulcan state university address",
        "what is the address of bulsu main?",
        "what is the address of bulsu?",
        "what is the address of Bulacan state university?",
        "where is the location of bulsu main?",
        "where is the location of bulsu?",
        "where can i find BulSU?",
        "where can i find BulSU main?",
        "where is the location of Bulacan state university main?",
        "address of bulsu",
        "address of Bulacan state university",
        "address of bulsu main",
        "exact location of bulsu",
        "exact location of bulsu main",
        "exact location of Bulacan state university",
        "do you know where is bulsu location",
        "do you know where is bulsu main location",
        "do you know what is the address of bulsu",
        "do you know what is the address of bulsu main",
        "do you know where to find bulsu main?",
        "do you know where to find bulsu?",
        "do you know where to find Bulacan state university?"

      ],
      "responses": [
        "BulSU MAIN address is in Guinhawa, City of Malolos, Bulacan",
        "You can find us at Guinhawa, City of Malolos, Bulacan",
        "Our Address is Guinhawa, City of Malolos, Bulacan"
      ],
      "context_set": ""
    },
    {
      "tag": "Bustos Campus Address",
      "patterns": [
        "Bustos Campus Address?",
        "Bulacan state university Bustos Campus Address?",
        "BulSU bustos campus address",
        "what is the address of Bustos Campus?",
        "what is the address of Bulacan state university Bustos Campus?",
        "what is the address of BulSU Bustos Campus?",
        "where is the location of Bulacan state university Bustos Campus?",
        "where is the location of Bustos Campus?",
        "where is the location of BulSU Bustos Campus?",
        "Location of Bustos Campus",
        "Address of Bustos Campus",
        "exact location of Bustos Campus",
        "exact location of Bulacan state university Bustos Campus",
        "do you know where is bulsu Bustos Campus location",
        "do you know where is Bustos Campus location",
        "do you know what is the address of Bustos Campus",
        "do you know what is the address of bulsu Bustos Campus",
        "do you know where to find bulsu Bustos Campus?",
        "do you know where to find Bustos Campus?",
        "do you know where to find Bulacan state university Bustos Campus?"
      ],
      "responses": [
        "BulSU Bustos Campus is located at C.L. Hilario Street, Bustos, Bulacan",
        "You can find us at C.L. Hilario Street, Bustos, Bulacan",
        "Our Address is C.L. Hilario Street, Bustos, Bulacan"
      ],
      "context_set": ""
    },
    {
      "tag": "Meneses Campus Address",
      "patterns": [
        "Meneses Campus Address?",
        "Bulacan state university Meneses Campus Address?",
        "BulSU Meneses Campus address",
        "what is the address of Meneses Campus?",
        "what is the address of Bulacan state university Meneses Campus?",
        "what is the address of BulSU Meneses Campus?",
        "where is the location of Bulacan state university Meneses Campus?",
        "where is the location of Meneses Campus?",
        "where is the location of BulSU Meneses Campus?",
        "Location of Meneses Campus",
        "Address of Meneses Campus",
        "exact location of Meneses Campus",
        "exact location of Bulacan state university Meneses Campus",
        "do you know where is bulsu Meneses Campus location",
        "do you know where is Meneses Campus location",
        "do you know what is the address of Meneses Campus",
        "do you know what is the address of bulsu Meneses Campus",
        "do you know where to find bulsu Meneses Campus?",
        "do you know where to find Meneses Campus?",
        "do you know where to find Bulacan state university Meneses Campus?"
      ],
      "responses": [
        "BulSU Meneses Campus is located in town of Bulakan, Bulacan",
        "You can find us at town of Bulakan,  Bulacan",
        "Our Address is town of Bulakan, Bulacan"
      ],
      "context_set": ""
    },
    {
      "tag": "Sarmiento Campus Address",
      "patterns": [
        "Sarmiento Campus Address?",
        "Bulacan state university Sarmiento Campus Address?",
        "BulSU Sarmiento Campus address",
        "what is the address of Sarmiento Campus?",
        "what is the address of Bulacan state university Sarmiento Campus?",
        "what is the address of BulSU Sarmiento Campus?",
        "where is the location of Bulacan state university Sarmiento Campus?",
        "where is the location of Sarmiento Campus?",
        "where is the location of BulSU Sarmiento Campus?",
        "Location of Sarmiento Campus",
        "Address of Sarmiento Campus",
        "exact location of Sarmiento Campus",
        "exact location of Bulacan state university Sarmiento Campus",
        "do you know where is bulsu Sarmiento Campus location",
        "do you know where is Sarmiento Campus location",
        "do you know what is the address of Sarmiento Campus",
        "do you know what is the address of bulsu Sarmiento Campus",
        "do you know where to find bulsu Sarmiento Campus?",
        "do you know where to find Sarmiento Campus?",
        "do you know where to find Bulacan state university Sarmiento Campus?"
      ],
      "responses": [
        "BulSU Sarmiento Campus is located at City of San Jose Del Monte, Bulacan",
        "You can find us at City of San Jose Del Monte,  Bulacan",
        "Our Address is City of San Jose Del Monte, Bulacan"
      ],
      "context_set": ""
    },
    {
      "tag": "Hagonoy Campus Address",
      "patterns": [
        "Hagonoy Campus Address?",
        "Bulacan state university Hagonoy Campus Address?",
        "BulSU Hagonoy Campus address",
        "what is the address of Hagonoy Campus?",
        "what is the address of Bulacan state university Hagonoy Campus?",
        "what is the address of BulSU Hagonoy Campus?",
        "where is the location of Bulacan state university Hagonoy Campus?",
        "where is the location of Hagonoy Campus?",
        "where is the location of BulSU Hagonoy Campus?",
        "Location of Hagonoy Campus",
        "Address of Hagonoy Campus",
        "exact location of Hagonoy Campus",
        "exact location of Bulacan state university Hagonoy Campus",
        "do you know where is bulsu Hagonoy Campus location",
        "do you know where is Hagonoy Campus location",
        "do you know what is the address of Hagonoy Campus",
        "do you know what is the address of bulsu Hagonoy Campus",
        "do you know where to find bulsu Hagonoy Campus?",
        "do you know where to find Hagonoy Campus?",
        "do you know where to find Bulacan state university Hagonoy Campus?"
      ],
      "responses": [
        "BulSU Hagonoy Campus is located in province of Hagonoy, Bulacan",
        "You can find us at province of Hagonoy,  Bulacan",
        "Our Address is province of Hagonoy, Bulacan"
      ],
      "context_set": ""
    },
    {
      "tag": "BulSU History",
      "patterns": [
        "BulSU History",
        "What is the history of Bulacan State University",
        "History of Bulsu",
        "Bulacan State University History",
        "History of Bulacan State University"
      ],
      "responses": [
        "The Bulacan State University started as an intermediate school in 1904 and has now progressed into one of the biggest educational institutions in Region III.To know more about BulSU visit https://bulsu.edu.ph/about/"
      ],
      "context_set": ""
    },
    {
      "tag": "Vision of BulSU",
      "patterns": [
        "What is the Vision of Bulacan State University?",
        "Bulsu Vision",
        "Bulacan State University vision",
        "What is the Vision of BulSU?",
        "Vision of BulSU",
        "University Vision",
        "Vision of Bulacan State University",


        "Do you know what is bulsu vision?",
        "Do you know what is the vison of bulsu?",
        "What is the new university vision",
        "new vision of bulsu",
        "what is the new vision of bulsu?",
        "About vision of bulsu"
      ],
      "responses": [
        "The Vision of Bulacan State University is a progressive knowledge-generating institution globally recognized for excellent instruction, pioneering research, and responsive community engagements"
      ],
      "context_set": ""
    },
    {
      "tag": "Mission of BulSU",
      "patterns": [
        "What is the Mission of Bulacan State University?",
        "What is the Mission of BulSU?",
        "Mission of BulSU",
        "University Mission",
        "Bulsu Mission",
        "Mission of Bulacan State University",
        "Bulacan State University Mission",
        "Do you know what is bulsu Mission?",
        "Do you know what is the Mission of bulsu?",
        "What is the new university Mission",
        "new Mission of bulsu",
        "what is the new Mission of bulsu?",
        "About Mission of bulsu"
      ],
      "responses": [
        "The Mission of Bulacan State University exists to produce highly competent, ethical and service-oriented professionals that contribute to the sustainable socio-economic growth and development of the nation."
      ],
      "context_set": ""
    },
    {
      "tag": "Goal of BulSU",
      "patterns": [
        "What is the Goal of Bulacan State University?",
        "What is the Goal of BulSU?",
        "Goal of BulSU",
        "Goal of Bulacan State University",
        "Bulacan State University Goal",
        "BulSU Goal",
        "University Goal",
        "Do you know what is bulsu Goal?",
        "Do you know what is the Goal of bulsu?",
        "What is the new university Goal",
        "new Goal of bulsu",
        "what is the new Goal of bulsu?",
        "About Goal of bulsu"
      ],
      "responses": [
        "The Goal of Bulacan State University is to Provide Relevant Quality and Accessible Education, Innovative and Responsive Research and Public Engagement, BulSU in Regional Development, Sound Financial Management and Good Governance. To know more details about the Goals of BulSU visit https://bulsu.edu.ph/about/ "
      ],
      "context_set": ""
    },
    {
      "tag": "BulSU Contact",
      "patterns": [
        "University Contact",
        "BulSU Contact",
        "Bulacan State University Contact",
        "What is the contact of BulSU?",
        "What is the contact of Bulacan State University",
        "how can i reach the bulsu?",
        "how can i get in touch with bulsu?",
        "can i get the contact number of bulsu",
        "can i get the email address of bulsu",
        "can you give the contact number of bulsu"
      ],
      "responses": [
        "Hello! You can give us a call  919-7800 or send us an E-mail at officeofthepresident@bulsu.edu.ph",
        "Good day! Our telephone number is 919-7800 and our E-mail is officeofthepresident@bulsu.edu.ph"
      ],
      "context_set": ""
    },
    {
      "tag": "Quality Policy of BulSU",
      "patterns": [
        "What is the Quality Policy of Bulacan State University?",
        "What is the Quality Policy of BulSU?",
        "Quality Policy of BulSU",
        "Quality Policy of Bulacan State University",
        "Do you know what is the quality policy of bulsu? "
      ],
      "responses": [
        "random^random5"
      ],
      "context_set": ""
    },
    {
      "tag": "BulSU Announcement",
      "patterns": [
        "BulSU Announcement",
        "Bulacan State University Announcement",
        "Announcement",
        "University Announcement",
        "What are the Announcement in Bulacan State University?",
        "What are the Announcement in BulSU?"
      ],
      "responses": [
        "To know the University Announcements visit https://bulsu.edu.ph/announcements/ "
      ],
      "context_set": ""
    },
    {
      "tag": "BulSU News",
      "patterns": [
        "BulSU News",
        "News",
        "University News",
        "Bulacan State University News",
        "News in Bulacan State University",
        "News in BulSU",
        "Do Have latest news or updates in BulSU?"
      ],
      "responses": [
        "To know the University News you can visit https://bulsu.edu.ph/news/ "
      ],
      "context_set": ""
    },
    {
      "tag": "Bids and awards",
      "patterns": [
        "Bids and awards",
        "BulSU Bids and awards",
        "what are the Birds and awards of BulSU?",
        "what are the Birds and awards of Bulacan State University?",
        "University Bids and awards"
      ],
      "responses": [
        "To know the University Bids and Awards visit https://bulsu.edu.ph/bids-and-awards/"
      ],
      "context_set": ""
    },
    {
      "tag": "Transparency Seal",
      "patterns": [
        "Transparency Seal",
        "BulSU Transparency Seal",
        "what are the Transparency Seal of BulSU?",
        "what are the Transparency Seal of Bulacan State University?",
        "University Transparency Seal"
      ],
      "responses": [
        "The Transparency Seal, depicted by a pearl shining out of an open shell, is a symbol of a policy shift towards openness in access to government information. click the link to know more https://bulsu.edu.ph/transparency-seal/ "
      ],
      "context_set": ""
    },
    {
      "tag": "Job Vacancies",
      "patterns": [
        "Is there any Job vancancies at BulSU?",
        "Job Vacancies",
        "Job Available at BulSU",
        "Job Available at Bulacan State University",
        "BulSU Job Vacancies",
        "Bulacan State University Job Vacancies",
        "Available Job Vacancies",
        "Available Jobs",
        "List of job vacancies in BulSU",
        "List of vacancies of job in bulsu"
      ],
      "responses": [
        "To know the available Job Vacancies click this link https://bulsu.edu.ph/job-vacancies/ "
      ],
      "context_set": ""
    },
    {
      "tag": "population of student in bulsu",
      "database": "populations",
      "patterns": [
        "population of student in bulsu",
        "population of student in Bulacan State University",
        "how many student bulsu have?",
        "how many student Bulacan State University have?",
        "Bulsu current student population",
        "Bulacan State University current student population",
        "Bulsu current number of student population",
        "How many students in bulsu campus",
        "Number of students in bulsu?",
        "How many students are enrolled in bulsu",
        "Population of students enrolled in bulsu"
      ],
      "responses": [
        "populations^bulsu"
      ],
      "context_set": ""
    },
    {
      "tag": "population of student in college of CAFA",
      "database": "populations",
      "patterns": [
        "population of student in college of CAFA",
        "how many student CAFA have?",
        "CAFA current student population",
        "CAFA current number of student population",
        "Number of students in CAFA?",
        "How many students are enrolled in CAFA",
        "Population of students enrolled in CAFA"
      ],
      "responses": [
        "populations^CAFA"
      ],
      "context_set": ""
    },
    {
      "tag": "population of student in college of CAL",
      "database": "populations",
      "patterns": [
        "population of student in college of CAL",
        "how many student CAL have?",
        "CAL current student population",
        "CAL current number of student population",
        "Number of students in CAL?",
        "How many students are enrolled in CAL",
        "Population of students enrolled in CAL"
      ],
      "responses": [
        "populations^CAL"
      ],
      "context_set": ""
    },
    {
      "tag": "population of student in college of CBA",
      "database": "populations",
      "patterns": [
        "population of student in college of CBA",
        "how many student CBA have?",
        "CBA current student population",
        "CBA current number of student population",
        "Number of students in CBA?",
        "How many students are enrolled in CBA",
        "Population of students enrolled in CBA"
      ],
      "responses": [
        "populations^CBA"
      ],
      "context_set": ""
    },
    {
      "tag": "population of student in college of CCJE",
      "database": "populations",
      "patterns": [
        "population of student in college of CCJE",
        "how many student CCJE have?",
        "CCJE current student population",
        "CCJE current number of student population",
        "Number of students in CCJE?",
        "How many students are enrolled in CCJE",
        "Population of students enrolled in CCJE"
      ],
      "responses": [
        "populations^CCJE"
      ],
      "context_set": ""
    },
    {
      "tag": "population of student in college of CHTM",
      "database": "populations",
      "patterns": [
        "population of student in college of CHTM",
        "how many student CHTM have?",
        "CHTM current student population",
        "CHTM current number of student population",
        "Number of students in CHTM?",
        "How many students are enrolled in CHTM",
        "Population of students enrolled in CHTM"
      ],
      "responses": [
        "populations^CHTM"
      ],
      "context_set": ""
    },
    {
      "tag": "population of student in college of CICT",
      "database": "populations",
      "patterns": [
        "population of student in college of CICT",
        "how many student CICT have?",
        "CICT current student population",
        "CICT current number of student population",
        "Number of students in CICT?",
        "How many students are enrolled in CICT",
        "Population of students enrolled in CICT"
      ],
      "responses": [
        "populations^CICT"
      ],
      "context_set": ""
    },
    {
      "tag": "population of student in college of CIT",
      "database": "populations",
      "patterns": [
        "population of student in college of CIT",
        "how many student CIT have?",
        "CIT current student population",
        "CIT current number of student population",
        "Number of students in CIT?",
        "How many students are enrolled in CIT",
        "Population of students enrolled in CIT"
      ],
      "responses": [
        "populations^CIT"
      ],
      "context_set": ""
    },
    {
      "tag": "population of student in college of Claw",
      "database": "populations",
      "patterns": [
        "population of student in college of Claw",
        "how many student Claw have?",
        "Claw current student population",
        "Claw current number of student population",
        "Number of students in Claw?",
        "How many students are enrolled in Claw",
        "Population of students enrolled in Claw"
      ],
      "responses": [
        "populations^Claw"
      ],
      "context_set": ""
    },
    {
      "tag": "population of student in college of CN",
      "database": "populations",
      "patterns": [
        "population of student in college of CON",
        "how many student CON have?",
        "CON current student population",
        "CON current number of student population",
        "Number of students in CON?",
        "How many students are enrolled in CON",
        "Population of students enrolled in CON"
      ],
      "responses": [
        "populations^CN"
      ],
      "context_set": ""
    },
    {
      "tag": "population of student in college of COED",
      "database": "populations",
      "patterns": [
        "population of student in college of COED",
        "how many student COED have?",
        "COED current student population",
        "COED current number of student population",
        "Number of students in COED?",
        "How many students are enrolled in COED",
        "Population of students enrolled in COED"
      ],
      "responses": [
        "populations^COED"
      ],
      "context_set": ""
    },
    {
      "tag": "population of student in college of CAFA",
      "database": "populations",
      "patterns": [
        "population of student in college of CAFA",
        "how many student CAFA have?",
        "CAFA current student population",
        "CAFA current number of student population",
        "Number of students in CAFA?",
        "How many students are enrolled in CAFA",
        "Population of students enrolled in CAFA"
      ],
      "responses": [
        "populations^CAFA"
      ],
      "context_set": ""
    },
    {
      "tag": "population of student in college of CS",
      "database": "populations",
      "patterns": [
        "population of student in college of CS",
        "how many student CS have?",
        "CS current student population",
        "CS current number of student population",
        "Number of students in CS?",
        "How many students are enrolled in CS",
        "Population of students enrolled in CS"
      ],
      "responses": [
        "populations^CS"
      ],
      "context_set": ""
    },
    {
      "tag": "population of student in college of CSSP",
      "database": "populations",
      "patterns": [
        "population of student in college of CSSP",
        "how many student CSSP have?",
        "CSSP current student population",
        "CSSP current number of student population",
        "Number of students in CSSP?",
        "How many students are enrolled in CSSP",
        "Population of students enrolled in CSSP"
      ],
      "responses": [
        "populations^CSSP"
      ],
      "context_set": ""
    },
    {
      "tag": "population of student in Graduate school",
      "database": "populations",
      "patterns": [
        "population of student in Graduate school",
        "how many student Graduate school have?",
        "Graduate school current student population",
        "Graduate school current number of student population",
        "Number of students in Graduate school?",
        "How many students are enrolled in Graduate school",
        "Population of students enrolled in Graduate school"
      ],
      "responses": [
        "populations^Graduate school"
      ],
      "context_set": ""
    },
    {
      "tag": "population of student in college of COE",
      "database": "populations",
      "patterns": [
        "population of student in college of COE",
        "how many student CACOEFA have?",
        "COE current student population",
        "COE current number of student population",
        "Number of students in COE?",
        "How many students are enrolled in COE",
        "Population of students enrolled in COE"
      ],
      "responses": [
        "populations^COE"
      ],
      "context_set": ""
    },
    {
      "tag": "Irregular student",
      "patterns": [
        "What is Irregular student?",
        "What is Irregular?",
        "Meaning of Irregular Student?",
        "Can you explain what is Irregular student?"
      ],
      "responses": [
        "A irregular student is one who registered for formal credits but who carries less than the full load  for a given semester to complete the requirements of the given curriculum."
      ],
      "context_set": ""
    },
    {
      "tag": "regular student",
      "patterns": [
        "What is regular student?",
        "What is regular?",
        "regular student",
        "Regular Student Meaning",
        "Can you explain what is Regular student?"
      ],
      "responses": [
        "A regular student is one who registers for formal academic credits and who carries the full load for a given semester and curriculum."
      ],
      "context_set": ""
    },
    {
      "tag": "shifter student",
      "patterns": [
        "What is shifter student?",
        "What is shifter?",
        "shifter student",
        "Shifter Student Meaning",
        "Can you explain what is Shifter student?"
      ],
      "responses": [
        "A shifter student is one who enrolls from one course to another within the same or another college/ campusof the University."
      ],
      "context_set": ""
    },
    {
      "tag": "transferee student",
      "patterns": [
        "What is transferee student?",
        "What is transferee?",
        "transferee student",
        "Transferee meaning",
        "Can you explain what is Transferee student?"
      ],
      "responses": [
        "A transferee student is one who had come from another recognized institution of higher learning and officially allowed to enroll to the same or another course in the University."
      ],
      "context_set": ""
    },
    {
      "tag": "working student",
      "patterns": [
        "What is working student?",
        "working student"
      ],
      "responses": [
        "A working student has part time job while studying. A working student may be allowed to enroll a minimum of fifteen (15) academic units in a given term or semester"
      ],
      "context_set": ""
    },
    {
      "tag": "foreign student",
      "patterns": [
        "What is foreign student?",
        "foreign student",
        "Foreign Student Meaning"
      ],
      "responses": [
        "A foreign student is one who is not a citizen of the Philippines."
      ],
      "context_set": ""
    },
    {
      "tag": "special student",
      "patterns": [
        "What is special student?",
        "Special Student",
        "who are the special Students",
        "Special Student meaning"
      ],
      "responses": [
        "A special student is one who is not earning credits for his academic work. Specialstudent may  enroll a maximum of nine (9) units per semester. He may enroll for a maximum two (2) academic  years.  The unit head concerned may recommend exemption to this limitation, subject to the approval by the Vice  President for Academic Affairs."
      ],
      "context_set": ""
    },
    {
      "tag": "classification of students",
      "patterns": [
        "What are classification of students?",
        "Classification of students",
        "Classification of students meaning"
      ],
      "responses": [
        "Students in the university are classfied as regular, irregular, shifter, transferee, working, foreign, and special student"
      ],
      "context_set": ""
    },
    {
      "tag": "requirements in admission",
      "patterns": [
        "What are the requirements in admission?",
        "bulsu ADMISSION REQUIREMENTS",
        "University admission requirements",
        "what are the requirements to become a student of bulsu",
        "how to be student of bulsu",
        "how to become a student of bulsu",
        "how to become a student of Bulacan State University",
        "grade requirements in bulsu",
        "Bulsu application Requirements",
        "APPLICATION REQUIREMENTS",
        "What are the requirements need in Admission for enrollment?",
        "How to inquire in bulsu admission for enrollment",
        "inquire in bulsu admission",
        "inquire in admission",
        "how to inquire in admission"
      ],
      "responses": [
        "To know about application requirements and grade requirements in Admission please click https://www.bulsu.edu.ph/admission/requirements.php"
      ],
      "context_set": ""
    },
    {
      "tag": "drop a subject",
      "patterns": [
        "How to drop a subject?",
        "drop a subject?",
        "dropping a subject?",
        "Process on how to drop a subject",
        "can i drop a subject?",
        "how can i drop a subject?",
        "can i drop a subject in the middle of semester?"
      ],
      "responses": [
        "Any student may officially drop his subject(s) until one (1) week before the midterm examinations as scheduled in the University calendar. The student must file the official dropping form at the Registrar's Office for this purpose."
      ],
      "context_set": ""
    },
    {
      "tag": "how many absences before i got drop",
      "patterns": [
        "how many absences before i got drop?",
        "number of absences to be considered as dropped",
        "how many absences to get drop by prof?",
        "number of absences to be dropped",
        "number of absences to be considered as dropped",
        "rules to be drop"
      ],
      "responses": [
        "Any student who accumulates more than twenty percent (20%) of the time of unexcusedabsences from any  of his/her subject before the midterm examinations shall be dropped automatically from that  subject.  The instructor concerned shall mark him/her FDA (failure due absences) or UD (unofficially dropped) from his subject."
      ],
      "context_set": ""
    },
    {
      "tag": "how many minutes before i got mark as late",
      "patterns": [
        "how many hours before i got mark as late?",
        "how many minutes before i got mark as late?",
        "rule to be mark as late?",
        "How much time before i got mark as late?",
        "number of time to be considered late",
        "minutes considered as late"
      ],
      "responses": [
        "A student shall be marked tardy if he arrives in the class 15 minutes after the start of the scheduled time.."
      ],
      "context_set": ""
    },
    {
      "tag": "how many hours before i got mark as absent",
      "patterns": [
        "how many hours before i got marked as absent?",
        "how many minutes before i got mark as absent?",
        "rule to be mark as absent?",
        "number of hours to be marked absent",
        "how many minutes to be considered as absent",
        "number of time to considered as absent in a subject?"
      ],
      "responses": [
        "A student shall be marked absent from the class if he/shearrives 20 minutes after the start of the scheduled time. However, student must not be deprived of attending the lesson if he wishes."
      ],
      "context_set": ""
    },
    {
      "tag": "how long should we wait for our proffessor",
      "patterns": [
        "how many hours should i wait for my professor before i leave?",
        "how many minutes should i wait for my professor before i leave?",
        "how long should we wait for our professor?",
        "how long should we wait for our instructor?",
        "how many hours should i wait for my instructor before i leave?",
        "how many minutes should i wait for my instructor before i leave?"
      ],
      "responses": [
        "Unless the subject teacher concerned gave prior notice, students may leave their assigned room if the teacher fails to come within 15 minutes after the start of the scheduled time for a one-hour class, 30minutes for a two-hour class, 45 minutes for a three-hour class, and so on. The student shall be marked absent if he/she leaves their assigned room before the prescribed waiting time."
      ],
      "context_set": ""
    },
    {
      "tag": "grading system of bulsu",
      "patterns": [
        "what is the grading system of bulsu?",
        "grading system of bulsu",
        "bulsu grading system",
        "what is the grading system of Bulacan State University?",
        "grading system of Bulacan State University"
      ],
      "responses": [
        "random^random6"
      ],
      "context_set": ""
    },
    {
      "tag": "What is 4 in grade",
      "patterns": [
        "What is 4 in grade?",
        "What is 4.00 in grade?"
      ],
      "responses": [
        "4.00(Conditional Passed) indicates that there is a slight deficiency in the performance of the student to  satisfy the minimum requirements the course for him to earn the lowest passing grade of 3. The student, in consultation with the subject teacher concerned, must resolve this deficiency within two (2) weeks after he/she  received the grade; otherwise the grade automatically becomes 5.00. The grade of 4.00 shall not appear in the student's permanent records or transcript of records"
      ],
      "context_set": ""
    },
    {
      "tag": "What is INC in grade?",
      "patterns": [
        "What is INC in grade?",
        "INC",
        "what is INC?"
      ],
      "responses": [
        "Inc.(Incomplete) indicates that the student has been getting passing marks in all criteria for grading except that he lacks certain project or activity requiredin the course. The student hasa grace periodof one (1) year  to complete the requirements; otherwise, 'Inc.' automatically becomes '5.00'. If the student got the mark of 'Inc.' in a prerequisite subject, he may not enroll the subject in which it is a prerequisite until he has completed such prerequisite subject."
      ],
      "context_set": ""
    },
    {
      "tag": "What is D in grade",
      "patterns": [
        "What is D in grade?",
        "D",
        "what is D?"
      ],
      "responses": [
        "D (Officially Dropped) indicates that the student officially filled a formal dropping form, duly signed by the  respective instructor/professor, dean and the university registrar."
      ],
      "context_set": ""
    },
    {
      "tag": "What is FDA or UD in grade",
      "patterns": [
        "What is FDA or UD in grade?",
        "FDA or UD",
        "what is FDA or UD?"
      ],
      "responses": [
        "FDA or UD(Failure Due to Absences or Unofficially Dropped) indicates that the  student discontinue attending   the class without notice to th teacher concerned resulting to failure or unofficially dropped the subject."
      ],
      "context_set": ""
    },
    {
      "tag": "What is Gold gear awards",
      "patterns": [
        "What is Gold gear awards?",
        "Gold gear awards",
        "Can you explain the gold gear awards?"
      ],
      "responses": [
        "The Gold Gear Awards is an annual recognitionprogramfor students for the formal awarding of academic  excellence, co-curricular and extra-curricular awards. The Office of the Dean for Student Affairs and Services in coordination with the different academic units of the University shall be responsible for the conduct of this program.."
      ],
      "context_set": ""
    },
    {
      "tag": "What is The Presidents List Award",
      "patterns": [
        "What is The President List Award?",
        "What is The Presidents List Award?",
        "President List Award",
        "Bulsu President List Award",
        "Presidents List Award",
        "Can you explain the Presidents List awards?"
      ],
      "responses": [
        "The President's List Awardis given to students with a grade point average of 1.20-1.00 and no grade lower than 2.0 in any subject enrolled for the last two consecutive semesters prior to the award."
      ],
      "context_set": ""
    },
    {
      "tag": "What is The Deans List Award",
      "patterns": [
        "What is The Deans List Award?",
        "What is The Dean List Award?",
        "Deans List Award",
        "Dean List Award",
        "Can you explain the Dean List Award",
        "what is dean list",
        "what is the dean list",
        "what is dean lister",
        "dean list",
        "dean lister"
      ],
      "responses": [
        "The Dean's List Award is given to students with a grade point average of 1.75-1.21 and no gradelower than 2.0 in any subject enrolled for the last two consecutive semesters prior to the award."
      ],
      "context_set": ""
    },
    {
      "tag": "candidates for the awards must have been",
      "patterns": [
        "how to be the Presidents List Award",
        "how to be the President List Award",
        "how get the Presidents List Award",
        "how get the President List Award",
        "who can be the Presidents List Award",
        "who can be the President List Award",
        "how to be the Deans List Award",
        "how to be the Dean List Award",
        "how get the Deans List Award",
        "how get the Dean List Award",
        "who can be the Deans List Award",
        "who can be the Dean List Award",
        "is im qualified to be dean list",
        "is im qualified to become dean list",
        "is im qualified to become dean lister",
        "is im qualified to be dean lister",
        "can i become dean list",
        "how to become a dean list",
        "how to qualified as dean lister"
        
      ],
      "responses": [
        "The candidates for the awards must have been officially enrolled with a minimum of 15 academic units or as prescribed in the regular curriculum in the last two consecutive semesters, i.e., 2nd semester of the preceding academic year and 1st semester of the current academic year. Only students from 2ndyear to senior year shall be entitled for these awards."
      ],
      "context_set": ""
    },
    {
      "tag": "What is Co-Curricular and Extra-Curricular Awards",
      "patterns": [
        "What is Co-Curricular and Extra-Curricular Awards",
        "Co-Curricular and Extra-Curricular Awards",
        "Co-Curricular awards",
        "Extra-Curricular awards"
      ],
      "responses": [
        "To encourage excellence in co-curricular and extra-curricular activities,the University shall award  non-academic honors and recognition to deserving students based on approved criteria and standards set by Committee on Awards."
      ],
      "context_set": ""
    },
    {
      "tag": "What Competitor winners will get",
      "patterns": [
        "What Competitor winners will get",
        "What is Competitor winners",
        "what if i win competition?",
        "what if i won competition?",
        "what if i win in a competition?",
        "What if i won in a competiton?"
      ],
      "responses": [
        "Competition Winners. This award shall be limited to achievements in connection with duly accredited competitions in the academic, trade skills, cultural, arts and sports to which students officially represent the university or any of its  units. The awards shall be categorized in terms of degree or level of performance attained by the students in duly accredited competition. as follows <br/> a. International Level 1st to 5th place winners <br/> b.National Level 1st to 3rd place winners <br/> c.Regional Level 1st and 2nd place winners and <br/> d.Provincial or Division 1st place winners."
      ],
      "context_set": ""
    },
    {
      "tag": "What is Extra-Curricular Awards",
      "patterns": [
        "What is Extra-Curricular Awards",
        "What is Extra Curricular Awards"
      ],
      "responses": [
        "These special awards are given to students who made an exemplary achievements in their field of interest and  unconditionally shared to BulSU community. The candidates of these awards are nominated by the advisers of the  concerned organization and submitted to the dean of student affairs and service"
      ],
      "context_set": ""
    },
    {
      "tag": "Extra-Curricular Awards list",
      "patterns": [
        "What are different types of Extra-Curricular Awards",
        "Extra-Curricular Awards list",
        "Extra Curricular Awards list"
      ],
      "responses": [
        "a. Journalists of the Year <br/> b.Male and Female Athletes <br/> c.Male and Female Performing Artists <br/> d.Student Government Leaders <br/> e.Student Organizations Leaders <br/> Note:Acandidate for any of the award shall have no disciplinary record on the current academic year."
      ],
      "context_set": ""
    },
    {
      "tag": "What are Graduation Requirements",
      "patterns": [
        "What are Graduation Requirements",
        "Graduation Requirements in bulsu",
        "Graduation Requiremts",
        "requirements in graduation",
        "how to graduate in bulsu",
        "Graduation candidates",
        "how to list in Graduation candidates"
      ],
      "responses": [
        "1. Each student who has satisfied all the requirements of his/her course is required to apply for graduation  by filing the official Application for Graduation form to the office of the Registrar. <br/> 2. All candidates for  graduation must be cleared of all property and money accountabilities in the University before the commencement exercises. <br/> 3.No student shall graduate from this University unless he/she has completed at least one year of residence prior to the date of graduation. <br/> 4.All disciplinary charges against a student must be resolved and  sanctions completed before a student is eligible to graduate"
      ],
      "context_set": ""
    },
    {
      "tag": "Qualification to be Summa Cum Laude",
      "patterns": [
        "What is Summa Cum Laude",
        "How to be summa cum laude",
        "How to become summa cum laude",
        "Summa Cum Laude",
        "Qualification to be Summa Cum Laude",
        "Requirements to be Summa Cum Laude"
      ],
      "responses": [
        "random^random7"
      ],
      "context_set": ""
    },
    {
      "tag": "Qualification to be Magna Cum Laude",
      "patterns": [
        "What is Magna Cum Laude",
        "How to be Magna cum laude",
        "How to become Magna cum laude",
        "Magna Cum Laude",
        "Qualification to be Magna Cum Laude",
        "Requirements to be Magna Cum Laude"
      ],
      "responses": [
        "random^random8"
      ],
      "context_set": ""
    },
    {
      "tag": "Qualification to be Cum Laude",
      "patterns": [
        "What is Cum Laude",
        "How to be cum laude",
        "How to become cum laude",
        "Cum Laude",
        "Qualification to be Cum Laude",
        "Requirements to be Cum Laude"
      ],
      "responses": [
        "random^random9"
      ],
      "context_set": ""
    },
    {
      "tag": "Qualification to be Outstanding Student Awards",
      "patterns": [
        "What is Outstanding Student Awards",
        "How to be Outstanding Student Awards",
        "How to become Outstanding Student Awards",
        "Outstanding Student Awards",
        "Qualification to be Outstanding Student Awards",
        "Requirements to be Outstanding Student Awards"
      ],
      "responses": [
        "random^random10"
      ],
      "context_set": ""
    },
    {
      "tag": "Qualification to be Best in Specialization Awards",
      "patterns": [
        "What is Best in Specialization Awards",
        "How to get Best in Specialization Awards",
        "Best in Specialization Awards",
        "Qualification to be Best in Specialization Awards",
        "Requirements to be Best in Specialization Awards"
      ],
      "responses": [
        "random^random11"
      ],
      "context_set": ""
    },
    {
      "tag": "Qualification to be University Leadership Award",
      "patterns": [
        "What is University Leadership Award",
        "How to be University Leadership Award",
        "How to get University Leadership Award",
        "How to become University Leadership Award",
        "University Leadership Award",
        "Qualification to be University Leadership Award",
        "Requirements to be University Leadership Award"
      ],
      "responses": [
        "random^random12"
      ],
      "context_set": ""
    },
    {
      "tag": "Qualification to have Loyalty Award",
      "patterns": [
        "What is Loyalty Award",
        "How to be Loyalty Award",
        "How to get Loyalty Award",
        "Loyalty Award",
        "Qualification to have Loyalty Award",
        "Requirements to have Loyalty Award"
      ],
      "responses": [
        "random^random13"
      ],
      "context_set": ""
    },
    {
      "tag": "get documents bitch",
      "patterns": [
        "how to get COR",
        "how to get COG",
        "how to get TOR",
        "how to get Academic Program Evaluation",
        "how to get Background Investigation Certification",
        "how to get Certificate as belong to the Upper 25% graduate",
        "how to get Certificate as Bona fide Student ",
        "how to get Certificate for Eligibility to Law School",
        "how to get Certificate of Academic Requirements Completed",
        "how to get Certificate of Candidate for Graduation",
        "how to get Certificate of Enrolment ",
        "how to get Certificate of Grades",
        "how to get Certificate of Graduation",
        "how to get Certificate of Official Grading System",
        "how to get Certificate of Registration",
        "how to get Certificate of Units Earned",
        "how to get Certification, Authentication and Verification",
        "how to get Certified True Copy - Certification ",
        "how to get Certified True Copy - Diploma",
        "how to get Certified True Copy - Registration Form (COR)",
        "how to get Certified True Copy - TOR",
        "how to get Course Description Certification",
        "how to get Diploma",
        "how to get English Proficiency Certification",
        "how to get Form 137",
        "how to get General Weighted Average Certificate",
        "how to get Good Moral",
        "how to get Graduate with Honor Certificate",
        "how to get Honorable Dismissal Form / Transfer Credential",
        "how to get Leave of Absence",
        "how to get Report of Grades",
        "how to get Supplemental Certificate",
        "how to get Transcript of Records"
      ],
      "responses": [
        "You can request any student record documents at BulSU Registar or you can request thru online here https://request.bulsu.edu.ph/request"
      ],
      "context_set": ""
    },
    {
      "tag": "Class cancelation",
      "database": "calendar",
      "patterns": [
        "Do we have class today",
        "Class cancelation",
        "is class is cancel today",
        "cancelation of classes today",
        "cancelation of classes",
        "is class is cancel",
        "class suspension",
        "class suspension today"
      ],
      "responses": [
        "calendar^cancel"
      ],
      "context_set": ""
    },
    {
      "tag": "Do we have class Tomorrow",
      "database": "calendar",
      "patterns": [
        "Do we have class Tomorrow",
        "Class cancelation Tomorrow",
        "is class is cancel Tomorrow",
        "cancelation of classes Tomorrow"
      ],
      "responses": [
        "calendar^cancel"
      ],
      "context_set": ""
    },
    {
      "tag": "is today is holiday?",
      "database": "calendar",
      "patterns": [
        "is today is holiday?",
        "today is holiday?",
        "is holiday today?"
      ],
      "responses": [
        "calendar^holiday"
      ],
      "context_set": ""
    },
    {
      "tag": "is tomorrow is holiday?",
      "database": "calendar",
      "patterns": [
        "is tomorrow is holiday?",
        "tomorrow is holiday?",
        "is holiday tomorrow?"
      ],
      "responses": [
        "calendar^holiday"
      ],
      "context_set": ""
    },
    {
      "tag": "When is Midterm?",
      "database": "calendar",
      "patterns": [
        "When is Midterm?",
        "When is Midterm examination?",
        "Midterm examination date",
        "Date of Midterm examination",
        "when the midterm exam start",
        "when is the midterm exam will start",
        "announcement about midterm exam"
      ],
      "responses": [
        "calendar^midterm"
      ],
      "context_set": ""
    },
    {
      "tag": "When is Finals?",
      "database": "calendar",
      "patterns": [
        "When is Finals?",
        "When is Finals examination?",
        "Finals date",
        "Date of Finals examination",
        "Date of Final examination"
      ],
      "responses": [
        "calendar^finals"
      ],
      "context_set": ""
    },
    {
      "tag": "When is Atbulsu Examination",
      "database": "calendar",
      "patterns": [
        "When is Atbulsu Examination?",
        "Atbulsu examination",
        "Atbulsu entrance examination?",
        "Atbulsu entrance exam?",
        "Atbulsu entrance date",
        "Atbulsu date",
        "Date of Atbulsu entrance exam",
        "Date of entrance exam",
        "entrance exam"
      ],
      "responses": [
        "calendar^entrance_exam"
      ],
      "context_set": ""
    },
    {
      "tag": "When is start of the sem",
      "database": "calendar",
      "patterns": [
        "When is the start of the sem?",
        "When is the start of the semester?",
        "When is semester will open?",
        "when is the sem starts?",
        "when will the sem starts?",
        "School sem starts",
        "School semester starts",
        "School sem Open",
        "School semester Open",
        "semester start at"
      ],
      "responses": [
        "calendar^sem_open"
      ],
      "context_set": ""
    },
    {
      "tag": "When is will the semester end",
      "database": "calendar",
      "patterns": [
        "When will the semester end?",
        "When will the sem end?",
        "When is sem will end?",
        "when is the semester ends?",
        "School semester ends",
        "School sem ends"
      ],
      "responses": [
        "calendar^sem_end"
      ],
      "context_set": ""
    },
    {
      "tag": "unauthorized printed materials",
      "patterns": [
        "unauthorized printed materials on University campuses and premises?",
        "what if i print unauthorized materials?",
        "what if i print a book without permission?",
        "what if i photocopied a book without permission?",
        "what if i print a document without permission?"
      ],
      "responses": [
        "Littering ordistribution of unauthorized printed materials on University campuses and premises <br/> 1st OffenseVerbal Reprimand, <br/> 2nd Offense Written reprimand with warning and 4 hours of Transformational Experience, and <br/> 3rd Offense 10 hours of Transformational Experience and Guidance Intervention Program."
      ],
      "context_set": ""
    },
    {
      "tag": "Vandalism or unauthorized posting",
      "patterns": [
        "What are the consequences of Vandalism?",
        "What will happen if i draw on the wall?",
        "What if i caught vandalism",
        "What if i vandalis"
      ],
      "responses": [
        "Vandalism or unauthorized posting of printed materials on University property, campuses and premises: <br/> 1st Offense Verbal Reprimand, Cleaning the walls, andCommitment letter. <br/> 2nd Offense Written reprimand with warning, Cleaning the walls, and 4 hours of Transformational Experience. lastly, <br/> 3rd Offense 10 hours of Transformational Experience, Cleaning the walls, and Guidance intervention program."
      ],
      "context_set": ""
    },
    {
      "tag": "what are consequences of Unauthorized solicitation of funds",
      "patterns": [
        "What are the consequences of Unauthorized solicitation of funds?",
        "What are the consequences of selling of any ticket?",
        "What will happen if i sell Unauthorized tickets?",
        "What if i get caught selling Unauthorized tickets"
      ],
      "responses": [
        "1st Offense Verbal Reprimandand Restitution, 2nd Offense Written reprimand with warning, 4 hours of Transformational Experience and Restitution, 3rd Offense 10 hours of Transformational Experience, Guidance intervention program and Restitution"
      ],
      "context_set": ""
    },
    {
      "tag": "What should i do during earthquake",
      "patterns": [
        "What should i do during earthquake",
        "if there is an earthquake what should i do?",
        "earthquake",
        "Things to do when earthquakes happen"
      ],
      "responses": [
        "Stay calm.. and cover your head. If you're indoors, stand against a wall near the center of the building, stand in a doorway, or crawl under heavy furniture (a desk or table). Stay away from windows and outside doors. If you're outdoors, stay in the open away from power lines or anything that might fall. Stay away from buildings. BulSU administrations advice during an earthquake to go in Rizal park in Activity center and any open area because it is open and saftier"
      ],
      "context_set": ""
    },
    {
      "tag": "Where is clinic of bulsu",
      "patterns": [
        "Where is clinic of bulsu",
        "Where is the clinic",
        "Where can i find the clinic",
        "Location of clinic",
        "clinic location",
        "Location of bulsu clinic"
      ],
      "responses": [
        "You can find the clinic of Bulacan State University in front of the Chess institute beside Flores Hall."
      ],
      "context_set": ""
    },
    {
      "tag": "Where is Admission office of bulsu",
      "patterns": [
        "Where is admission office of bulsu",
        "Where is the admission office",
        "Where can i find the admission office",
        "Location of admission office",
        "admission office location",
        "Location of bulsu admission office"
      ],
      "responses": [
        "You can find the Admission Office of Bulacan State University Beside the building of the College of Law."
      ],
      "context_set": ""
    },
    {
      "tag": "Where is Guidance office of bulsu",
      "patterns": [
        "Where is guidance office of bulsu",
        "Where is the guidance office",
        "Where can i find the guidance office",
        "Location of guidance office",
        "guidance office location",
        "Location of bulsu guidance office"
      ],
      "responses": [
        "You can find the Guidance Office of Bulacan State University on the Ground floor of the Roxas Hall."
      ],
      "context_set": ""
    },
    {
      "tag": "Where is MIS office of bulsu",
      "patterns": [
        "Where is MIS office of bulsu",
        "Where is the MIS office",
        "Where can i find the MIS office",
        "Location of MIS office",
        "MIS office location",
        "Location of bulsu MIS office"
      ],
      "responses": [
        "You can find the MIS Office of Bulacan State University on the Ground floor of the Natividad Hall."
      ],
      "context_set": ""
    },
    {
      "tag": "Where is Registrar office of bulsu",
      "patterns": [
        "Where is Registrar office of bulsu",
        "Where is the Registrar office",
        "Where can i find the Registrar office",
        "Location of Registrar office",
        "Registrar office location",
        "Location of bulsu Registrar office"
      ],
      "responses": [
        "The BulSU Registrar Office is located at Flores Hall."
      ],
      "context_set": ""
    },
    {
      "tag": "Where is Cashier of bulsu",
      "patterns": [
        "Where is Cashier of bulsu",
        "Where is the Cashier",
        "Where can i find the Cashier",
        "Location of Cashier",
        "Cashier location",
        "Location of bulsu Cashier"
      ],
      "responses": [
        "The BulSU Cashier Office is located in the Flores Hall beside Registrar Office."
      ],
      "context_set": ""
    },
    {
      "tag": "what bulsu clinic provide",
      "patterns": [
        "what bulsu clinic provide?",
        "what do bulsu clinic provide?"
      ],
      "responses": [
        "The clinic of BulSU provide services such as Medical and Dental consultation and treatment, Annual physical/medical and dental examination of college freshmen, transferees and shifters, Health promotion and disease prevention through health education, programs and orientation, 4. Provides first –aid management to trauma and  emergency cases and participates in disaster preparedness plan of the University, Issues medical/dental certificates according to the needs of the client, Provides emergency ambulance conduction of patients to appropriate medical facilities, Institutes environmental projects and programs, Monitors campus hygiene and sanitation, Prevents diseases through vaccination and information dissemination campaign and Keeps health records of students, faculty and non-academic personnel."
      ],
      "context_set": ""
    },
    {
      "tag": "what Hostel provide",
      "patterns": [
        "what bulsu Hostel provide?",
        "what Hostel provide?",
        "what do bulsu Hostel provide?",
        "what services bulsu Hostel provide?",
        "what services bulsu Hostel?",
        "service of bulsu Hostel?",
        "Hostel services?",
        "Hostel service?",
        "Bulsu Hostel services?",
        "Bulsu student housing and dormitories?",
        "Bulsu student housing?",
        "student housing?",
        "Bulsu student dormitories?",
        "student dormitories?",
        "offer of Hostel",
        "service offer by Hostel",
        "university Hostel",
        "how to live in Hostel"
      ],
      "responses": [
        "The BulSU Hostel provides services of housing and dormitories for students of BulSU. To know more about student housing and dormitories and other services they offer you can visit https://www.bulsu.edu.ph/students/student-welfare-units.php?show=housing-and-dormitories ."
      ],
      "context_set": ""
    },
    {
      "tag": "sholarship in bulsu",
      "patterns": [
        "do bulsu offer scholarship?",
        "sholarship in bulsu",
        "how to be scholar in bulsu",
        "how to become scholar in bulsu",
        "Scholar update",
        "requirements to be scholar in bulsu",
        "qualifications to be scholar in bulsu",
        "requirements to become scholar in bulsu",
        "qualifications to become scholar in bulsu",
        "scholarship program by bulsu",
        "scholar",
        "scholarship",
        "i need scholarship",
        "scholarship offered by bulsu",
        "scholarship offer by bulsu"
      ],
      "responses": [
        "random^random14"
      ],
      "context_set": ""
    },
    {
      "tag": "where can i park my motor?",
      "database": "random",
      "patterns": [
        "where can i park my motor?",
        "where can i park my motorcycle?",
        "parking for motorcycle?",
        "how to park a motor in bulsu",
        "how to park a motorcycle in bulsu",
        "can i park motorcycle in bulsu",
        "can i park motor in bulsu",
        "Parking area for motorcycles",
        "Location of parking area of motorcycle",
        "motorcycle parking area"
      ],
      "responses": [
        "random^random1"
      ],
      "context_set": ""
    },
    {
      "tag": "where can i park my car?",
      "database": "random",
      "patterns": [
        "where can i park my car?",
        "parking for car?",
        "how to park a car in bulsu",
        "how to park a car in bulsu",
        "can i park car in bulsu",
        "Parking area for cars",
        "Location of parking area of car",
        "car parking area"
      ],
      "responses": [
        "random^random2"
      ],
      "context_set": ""
    },
    {
      "tag": "where can i park my bike?",
      "database": "random",
      "patterns": [
        "where can i park my bike?",
        "parking for bike?",
        "how to park a bike in bulsu",
        "how to park a bike in bulsu",
        "can i park bike in bulsu",
        "Parking area for bikes",
        "Location of parking area of bike",
        "bike parking area"
      ],
      "responses": [
        "random^random3"
      ],
      "context_set": ""
    },
    {
      "tag": "missing bitch vehicle",
      "database": "random",
      "patterns": [
        "i lost my car where can i report it?",
        "i lost my bike where can i report it?",
        "i lost my motor where can i report it?",
        "i lost my motorcycle where can i report it?",
        "my car is missing",
        "my bike is missing",
        "my motor is missing",
        "my motorcycle is missing",
        "where can i report missing vehicle",
        "where can i report missing car",
        "where can i report missing bike",
        "where can i report missing motor",
        "where can i report missing motorcycle"
      ],
      "responses": [
        "random^random4"
      ],
      "context_set": ""
    },
    {
      "tag": "when is washday",
      "patterns": [
        "when is washday",
        "everywhen is washday",
        "when is wash-day",
        "wash-day"
      ],
      "responses": [
        "Every thursday BulSU students can wear civilian attire"
      ],
      "context_set": ""
    },
    {
      "tag": "when is org shirt day",
      "patterns": [
        "when is org shirt day",
        "when is the org shirt day",
        "org shirt day",
        "when should i wear my org shirt",
        "what if i dont have org shirt"
      ],
      "responses": [
        "Every Friday a student is required to wear an Organizational shirts if a student do not have any org shirt they must wear a type A school uniform inside university"
      ],
      "context_set": ""
    },
    {
      "tag": "",
      "patterns": [],
      "responses": [],
      "context_set": ""
    },
    {
      "tag": "where can i buy org shirt?",
      "patterns": [
        "where can i buy org shirt?",
        "where can i get a org shirt?"
      ],
      "responses": [
        "I advice that you inquire to Organization that you want to buy the shirt. Most likely before you can buy a Org shirt you must be member of their organization and you will ask to pay for membership fee for small amount"
      ],
      "context_set": ""
    },
    {
      "tag": "where can i get p,e shirt?",
      "patterns": [
        "where can i get p.e. shirt?",
        "where can i buy p.e. shirt?"        
      ],
      "responses": [
        "P.E. shirts can be bought in the ground floor of Federizo hall in front of Heroes Park."
      ],
      "context_set": ""
    },
    {
      "tag": "can i use old p,e shirt",
      "patterns": [
        "can i use old p.e. shirt",
        "can i use old design of p,e shirt",
        "using old p,e shirt is allow?"
      ],
      "responses": [
        "Yes, you can use any P.E. shirt as long as it have logo or name of BulSU."
      ],
      "context_set": ""
    },
    {
      "tag": "where is the faculty of College of Arts and Letters",
      "patterns": [
        "where is the faculty of College of Arts and Letters",
        "where is the faculty of CAL",
        "where can i find the faculty of College of Arts and Letters",
        "where can i find the faculty of CAL",
        "faculty of CAL",
        "faculty of College of Arts and Letters ",
        "Location of Faculty of CAL",
        "Location of Faculty of College of Arts and Letters"
      ],
      "responses": [
        "The faculty of the College of Arts and Letters is located on the third floor of federizo Hall beside the accenture room."
      ],
      "context_set": ""
    },
    {
      "tag": "where is the faculty of Laboratory High School",
      "patterns": [
        "where is the faculty of Laboratory High School",
        "where is the faculty of Lab High",
        "where can i find the faculty of Laboratory High School",
        "where can i find the faculty of Lab High",
        "faculty of Lab High",
        "faculty of Laboratory High School",
        "Location of Faculty of Lab High",
        "Location of Faculty of Laboratory High School"
      ],
      "responses": [
        "The faculty of Laboratory High School is located on the ground floor of the lab high building"
      ],
      "context_set": ""
    },
    {
      "tag": "where is the faculty of College of Information & Communications Technology",
      "patterns": [
        "where is the faculty of College of Information & Communications Technology",
        "where is the faculty of CICT",
        "where can i find the faculty of College of Information & Communications Technology",
        "where can i find the faculty of CICT",
        "faculty of CICT",
        "faculty of College of Information & Communications Technology",
        "Location of Faculty of CICT",
        "Location of Faculty of College of Information & Communications Technology"
      ],
      "responses": [
        "The faculty of the College of Information & Communications Technology is located on the third floor of Pimentel hall at room IT1"
      ],
      "context_set": ""
    },
    {
      "tag": "where is the faculty of College of Engineering",
      "patterns": [
        "where is the faculty of College of Engineering",
        "where is the faculty of COE",
        "where can i find the faculty of College of Engineering",
        "where can i find the faculty of COE",
        "faculty of COE",
        "faculty of College of Engineering",
        "Location of Faculty of COE",
        "Location of Faculty of College of Engineering"
      ],
      "responses": [
        "The faculty of the College of Engineering is located on the third floor of Natividad hall."
      ],
      "context_set": ""
    },
    {
      "tag": "where is the faculty of College of Criminal Justice Education",
      "patterns": [
        "where is the faculty of College of Criminal Justice Education",
        "where is the faculty of CCJE",
        "where can i find the faculty of College of Criminal Justice Education",
        "where can i find the faculty of CCJE",
        "faculty of CCJE",
        "faculty of College of Criminal Justice Education",
        "Location of Faculty of CCJE",
        "Location of Faculty of College of Criminal Justice Education"
      ],
      "responses": [
        "The faculty of the College of Criminal Justice Education is located on the ground floor of the Chocolate building near at 3rd gate of BulSU."
      ],
      "context_set": ""
    },
    {
      "tag": "where is the faculty of College of Education",
      "patterns": [
        "where is the faculty of College of Education",
        "where is the faculty of COED",
        "where can i find the faculty of College of Education",
        "where can i find the faculty of COED",
        "faculty of COED",
        "faculty of College of Education ",
        "Location of Faculty of COED",
        "Location of Faculty of College of Education"
      ],
      "responses": [
        "The faculty of the College of Education is located on the third floor of Roxas hall beside the dean's office of COED."
      ],
      "context_set": ""
    },
    {
      "tag": "where is the faculty of College of Architecture & Fine Arts",
      "patterns": [
        "where is the faculty of College of Architecture & Fine Arts",
        "where is the faculty of CAFA",
        "where can i find the faculty of College of Architecture & Fine Arts",
        "where can i find the faculty of CAFA",
        "faculty of CAFA",
        "faculty of College of Architecture & Fine Arts",
        "Location of Faculty of CAFA",
        "Location of Faculty of College of Architecture & Fine Arts"
      ],
      "responses": [
        "The faculty of the College of Architecture & Fine Arts is located on the third floor of Federizo hall at room FH310."
      ],
      "context_set": ""
    },
    {
      "tag": "where is the faculty of College of Hospitality and Tourism Management",
      "patterns": [
        "where is the faculty of College of Hospitality and Tourism Management",
        "where is the faculty of CHTM",
        "where can i find the faculty of College of Hospitality and Tourism Management",
        "where can i find the faculty of CHTM",
        "faculty of CHTM",
        "faculty of College of Hospitality and Tourism Management",
        "Location of Faculty of CHTM",
        "Location of Faculty of College of Hospitality and Tourism Management"
      ],
      "responses": [
        "The faculty of the College of Hospitality and Tourism Management is located on the third floor of the CHTM building at room ROOM301."
      ],
      "context_set": ""
    },
    {
      "tag": "where is the faculty of College of Sports, Exercise, and Recreation",
      "patterns": [
        "where is the faculty of College of Sports, Exercise, and Recreation",
        "where is the faculty of CSER",
        "where can i find the faculty of College of Sports, Exercise, and Recreation",
        "where can i find the faculty of CSER",
        "faculty of CSER",
        "faculty of College of Sports, Exercise, and Recreation",
        "Location of Faculty of CSER",
        "Location of Faculty of College of Sports, Exercise, and Recreation"
      ],
      "responses": [
        "The faculty of the College of Sports, Exercise, and Recreation is located on the Chess institute in front of Flores hall."
      ],
      "context_set": ""
    },
    {
      "tag": "where is the faculty of College of Arts and Letters",
      "patterns": [
        "where is the faculty of College of Arts and Letters",
        "where is the faculty of CAL",
        "where can i find the faculty of College of Arts and Letters",
        "where can i find the faculty of CAL",
        "faculty of CAL",
        "faculty of College of Arts and Letters",
        "Location of Faculty of CAL",
        "Location of Faculty of College of Arts and Letters"
      ],
      "responses": [
        "The faculty of the College of Arts and Letters is located on the third floor of Federizo hall Beside Accenture room."
      ],
      "context_set": ""
    },
    {
      "tag": "where is the faculty of College of Business Administration",
      "patterns": [
        "where is the faculty of College of Business Administration",
        "where is the faculty of CBA",
        "where can i find the faculty of College of Business Administration",
        "where can i find the faculty of CBA",
        "faculty of CBA",
        "faculty of College of Business Administration",
        "Location of Faculty of CBA",
        "Location of Faculty of College of Business Administration"
      ],
      "responses": [
        "The faculty of the College of Business Administration is located on the ground floor of CBA building inf front of Roxas hall Building."
      ],
      "context_set": ""
    },
    {
      "tag": "where is the faculty of College of Science",
      "patterns": [
        "where is the faculty of College of Science",
        "where is the faculty of CS",
        "where can i find the faculty of College of Science",
        "where can i find the faculty of CS",
        "faculty of CS",
        "faculty of College of Science",
        "Location of Faculty of CS",
        "Location of Faculty of College of Science"
      ],
      "responses": [
        "The faculty of the College of Science is located on the ground floor of Federizo hall at room FH110."
      ],
      "context_set": ""
    },
    {
      "tag": "where is the faculty of College of Nursing",
      "patterns": [
        "where is the faculty of College of Nursing",
        "where is the faculty of CN",
        "where can i find the College of Nursing",
        "where can i find the faculty of CN",
        "faculty of CN",
        "faculty of College of Nursing",
        "Location of Faculty of CN",
        "Location of Faculty of College of Nursing"
      ],
      "responses": [
        "The faculty of the College of Nursing is located on ground floor of Pimentel hall beside staff room."
      ],
      "context_set": ""
    },
    {
      "tag": "where is the faculty of College of Social Sciences and Philosophy",
      "patterns": [
        "where is the faculty of College of Social Sciences and Philosophy",
        "where is the faculty of CSSP",
        "where can i find the faculty of College of Social Sciences and Philosophy",
        "where can i find the faculty of CSSP",
        "faculty of CSSP",
        "faculty of College of Social Sciences and Philosophy",
        "Location of Faculty of CSSP",
        "Location of Faculty of College of Social Sciences and Philosophy"
      ],
      "responses": [
        "The faculty of the College of Social Sciences and Philosophy is located on ground floor of Mendoza hall."
      ],
      "context_set": ""
    },
    {
      "tag": "where is the faculty of College of Industrial Technology",
      "patterns": [
        "where is the faculty of College of Industrial Technology",
        "where is the faculty of CIT",
        "where can i find the faculty of College of Industrial Technology",
        "where can i find the faculty of CIT",
        "faculty of CIT",
        "faculty of College of Industrial Technology",
        "Location of Faculty of CIT",
        "Location of Faculty of College of Industrial Technology"
      ],
      "responses": [
        "The faculty of the College of Industrial Technology is located on the ground floor and third floor of Alvarado hall."
      ],
      "context_set": ""
    },
    {
      "tag": "where is the faculty of College of Law",
      "patterns": [
        "where is the faculty of College of Law",
        "where is the faculty of Claw",
        "where can i find the faculty of College of Law",
        "where can i find the faculty of Claw",
        "faculty of Claw",
        "faculty of College of Law",
        "Location of Faculty of Claw",
        "Location of Faculty of College of Law"
      ],
      "responses": [
        "The faculty of the College of Law is located on the ground floor of the Law building."
      ],
      "context_set": ""
    },
    {
      "tag": "how to enroll in bulsu",
      "patterns": [
        "how to enroll in bulsu",
        "enrollment Procedure",
        "Process in enrollment",
        "Process in enrollment in bulsu",
        "enrollment Procedure For old students",
        "enrollment Procedure For New students",
        "update about enrollment"
      ],
      "responses": [
        "random^random15"
      ],
      "context_set": ""
    },        {
      "tag": "CICT Contact",
      "database": "DepartmentContacts",
      "patterns": [
       "How can I contact College of Information and Communications Technology?",
       "What is the contact number of College of Information and Communications Technology?",
       "Contact Information of College of Information and Communications Technology",
       "Email address of College of Information and Communications Technology",
       "facebook account of College of Information and Communications Technology",
       "Official facebook account of College of Information and Communications Technology",
       "College of Information and Communications Technology Contact number",
       "How can I contact  CICT?",
       "What is the contact number of CICT?",
       "Contact Information of CICT",
       "Email address of CICT",
       "facebook account of CICT",
       "Official facebook account of CICT",
       "CICT Contact number"
      ],
      "responses": [
          "Contacts^contac0"
      ],
      "context_set": ""
    },
    {
      "tag": "CAFA Contact",
      "database": "DepartmentContacts",
      "patterns": [
       "How can I contact College of Architecture and Fine Arts?",
       "What is the contact number of College of Architecture and Fine Arts?",
       "Contact Information of College of Architecture and Fine Arts",
       "Email address of College of Architecture and Fine Arts",
       "facebook account of College of Architecture and Fine Arts",
       "Official facebook account of College of Architecture and Fine Arts",
       "College of Architecture and Fine Arts Contact number",
       "How can I contact  CAFA?",
       "What is the contact number of CAFA?",
       "Contact Information of CAFA",
       "Email address of CAFA",
       "facebook account of CAFA",
       "Official facebook account of CAFA",
       "CAFA Contact number"
      ],
      "responses": [
          "Contacts^contac1"
      ],
      "context_set": ""
    },
    {
      "tag": "Claw Contact",
      "database": "DepartmentContacts",
      "patterns": [
       "How can I contact College of LAW?",
       "What is the contact number of College of LAW?",
       "Contact Information of College of LAW",
       "Email address of College of LAW",
       "facebook account of College of LAW",
       "Official facebook account of College of LAW",
       "College of LAW Contact number",
       "How can I contact  Claw?",
       "What is the contact number of Claw?",
       "Contact Information of Claw",
       "Email address of Claw",
       "facebook account of Claw",
       "Official facebook account of Claw",
       "Claw Contact number"
      ],
      "responses": [
          "Contacts^contac2"
      ],
      "context_set": ""
    },
    {
      "tag": "CAL Contact",
      "database": "DepartmentContacts",
      "patterns": [
       "How can I contact College Of Arts And Letters?",
       "What is the contact number of College Of Arts And Letters?",
       "Contact Information of College Of Arts And Letters",
       "Email address of College Of Arts And Letters",
       "facebook account of College Of Arts And Letters",
       "Official facebook account of College Of Arts And Letters",
       "College Of Arts And Letters Contact number",
       "How can I contact  CAL?",
       "What is the contact number of CAL?",
       "Contact Information of CAL",
       "Email address of CAL",
       "facebook account of CAL",
       "Official facebook account of CAL",
       "CAL Contact number"
      ],
      "responses": [
          "Contacts^contac3"
      ],
      "context_set": ""
    },
    {
      "tag": "CBA Contact",
      "database": "DepartmentContacts",
      "patterns": [
       "How can I contact College of Business Administration?",
       "What is the contact number of College of Business Administration?",
       "Contact Information of College of Business Administration",
       "Email address of College of Business Administration",
       "facebook account of College of Business Administration",
       "Official facebook account of College of Business Administration",
       "College of Business Administration Contact number",
       "How can I contact  CBA?",
       "What is the contact number of CBA?",
       "Contact Information of CBA",
       "Email address of CBA",
       "facebook account of CBA",
       "Official facebook account of CBA",
       "CBA Contact number"
      ],
      "responses": [
          "Contacts^contac4"
      ],
      "context_set": ""
    },
    {
      "tag": "CCJE Contact",
      "database": "DepartmentContacts",
      "patterns": [
       "How can I contact College of Criminal Justice Education?",
       "What is the contact number of College of Criminal Justice Education?",
       "Contact Information of College of Criminal Justice Education",
       "Email address of College of Criminal Justice Education",
       "facebook account of College of Criminal Justice Education",
       "Official facebook account of College of Criminal Justice Education",
       "College of Criminal Justice Education Contact number",
       "How can I contact  CCJE?",
       "What is the contact number of CCJE?",
       "Contact Information of CCJE",
       "Email address of CCJE",
       "facebook account of CCJE",
       "Official facebook account of CCJE",
       "CCJE Contact number"
      ],
      "responses": [
          "Contacts^contac5"
      ],
      "context_set": ""
    },
    {
      "tag": "CHTM Contact",
      "database": "DepartmentContacts",
      "patterns": [
       "How can I contact College of Hospitality and Tourism Management?",
       "What is the contact number of College of Hospitality and Tourism Management?",
       "Contact Information of College of Hospitality and Tourism Management",
       "Email address of College of Hospitality and Tourism Management",
       "facebook account of College of Hospitality and Tourism Management",
       "Official facebook account of College of Hospitality and Tourism Management",
       "College of Hospitality and Tourism Management Contact number",
       "How can I contact  CHTM?",
       "What is the contact number of CHTM?",
       "Contact Information of CHTM",
       "Email address of CHTM",
       "facebook account of CHTM",
       "Official facebook account of CHTM",
       "CHTM Contact number"
      ],
      "responses": [
          "Contacts^contac6"
      ],
      "context_set": ""
    },
    {
      "tag": "COE Contact",
      "database": "DepartmentContacts",
      "patterns": [
       "How can I contact College of Engineering?",
       "What is the contact number of College of Engineering?",
       "Contact Information of College of Engineering",
       "Email address of College of Engineering",
       "facebook account of College of Engineering",
       "Official facebook account of College of Engineering",
       "College of Engineering Contact number",
       "How can I contact  COE?",
       "What is the contact number of COE?",
       "Contact Information of COE",
       "Email address of COE",
       "facebook account of COE",
       "Official facebook account of COE",
       "COE Contact number"
      ],
      "responses": [
          "COE: Contacts^contac7"
      ],
      "context_set": ""
    },
    {
      "tag": "CIT Contact",
      "database": "DepartmentContacts",
      "patterns": [
       "How can I contact College of Industrial Technology?",
       "What is the contact number of College of Industrial Technology?",
       "Contact Information of College of Industrial Technology",
       "Email address of College of Industrial Technology",
       "facebook account of College of Industrial Technology",
       "Official facebook account of College of Industrial Technology",
       "College of Industrial Technology Contact number",
       "How can I contact  CIT?",
       "What is the contact number of CIT?",
       "Contact Information of CIT",
       "Email address of CIT",
       "facebook account of CIT",
       "Official facebook account of CIT",
       "CIT Contact number"
      ],
      "responses": [
          "Contacts^contac8"
      ],
      "context_set": ""
    },
    {
      "tag": "COEd Contact",
      "database": "DepartmentContacts",
      "patterns": [
       "How can I contact College of Education?",
       "What is the contact number of College of Education?",
       "Contact Information of College of Education",
       "Email address of College of Education",
       "facebook account of College of Education",
       "Official facebook account of College of Education",
       "College of Education Contact number",
       "How can I contact  COEd?",
       "What is the contact number of COEd?",
       "Contact Information of COEd",
       "Email address of COEd",
       "facebook account of COEd",
       "Official facebook account of COEd",
       "COEd Contact number"
      ],
      "responses": [
          "Contacts^contac9"
      ],
      "context_set": ""
    },
    {
      "tag": "CON Contact",
      "database": "DepartmentContacts",
      "patterns": [
       "How can I contact College of Nursing?",
       "What is the contact number of College of Nursing?",
       "Contact Information of College of Nursing",
       "Email address of College of Nursing",
       "facebook account of College of Nursing",
       "Official facebook account of College of Nursing",
       "College of Nursing Contact number",
       "How can I contact  CON?",
       "What is the contact number of CON?",
       "Contact Information of CON",
       "Email address of CON",
       "facebook account of CON",
       "Official facebook account of CON",
       "CON Contact number"
      ],
      "responses": [
          "Contacts^contac10"
      ],
      "context_set": ""
    },
    {
      "tag": "CS Contact",
      "database": "DepartmentContacts",
      "patterns": [
       "How can I contact College of Science?",
       "What is the contact number of College of Science?",
       "Contact Information of College of Science",
       "Email address of College of Science",
       "facebook account of College of Science",
       "Official facebook account of College of Science",
       "College of Science Contact number",
       "How can I contact  CS?",
       "What is the contact number of CS?",
       "Contact Information of CS",
       "Email address of CS",
       "facebook account of CS",
       "Official facebook account of CS",
       "CS Contact number"
      ],
      "responses": [
          "Contacts^contac11"
      ],
      "context_set": ""
    },
    {
      "tag": "CSER Contact",
      "database": "DepartmentContacts",
      "patterns": [
       "How can I contact College of Sports, Exercise and Recreation?",
       "What is the contact number of College of Sports, Exercise and Recreation?",
       "Contact Information of College of Sports, Exercise and Recreation",
       "Email address of College of Sports, Exercise and Recreation",
       "facebook account of College of Sports, Exercise and Recreation",
       "Official facebook account of College of Sports, Exercise and Recreation",
       "College of Sports, Exercise and Recreation Contact number",
       "How can I contact  CSER?",
       "What is the contact number of CSER?",
       "Contact Information of CSER",
       "Email address of CSER",
       "facebook account of CSER",
       "Official facebook account of CSER",
       "CSER Contact number"
      ],
      "responses": [
          "Contacts^contac12"
      ],
      "context_set": ""
    },
    {
      "tag": "CSSP Contact",
      "database": "DepartmentContacts",
      "patterns": [
       "How can I contact College of Social Science And Philosophy?",
       "What is the contact number of College of Social Science And Philosophy?",
       "Contact Information of College of Social Science And Philosophy",
       "Email address of College of Social Science And Philosophy",
       "facebook account of College of Social Science And Philosophy",
       "Official facebook account of College of Social Science And Philosophy",
       "College of Social Science And Philosophy Contact number",
       "How can I contact  CSSP?",
       "What is the contact number of CSSP?",
       "Contact Information of CSSP",
       "Email address of CSSP",
       "facebook account of CSSP",
       "Official facebook account of CSSP",
       "CSSP Contact number"
      ],
      "responses": [
          "Contacts^contac13"
      ],
      "context_set": ""
    },
    {
      "tag": "Graduate School Contact",
      "database": "DepartmentContacts",
      "patterns": [
       "How can I contact Graduate School?",
       "What is the contact number of Graduate School?",
       "Contact Information of Graduate School",
       "Email address of Graduate School",
       "facebook account of Graduate School",
       "Official facebook account of Graduate School",
       "Graduate School Contact number"
      ],
      "responses": [
          "Contacts^contac14"
      ],
      "context_set": ""
    },
    {
      "tag": "Admission Office Contact",
      "database": "DepartmentContacts",
      "patterns": [
       "How can I contact Admission Office?",
       "What is the contact number of Admission Office?",
       "Contact Information of Admission Office",
       "Email address of Admission Office",
       "facebook account of Admission Office",
       "Official facebook account of Admission Office",
       "Admission Office Contact number"
      ],
      "responses": [
          "Contacts^contac15"
      ],
      "context_set": ""
    },
    {
      "tag": "MIS Contact",
      "database": "DepartmentContacts",
      "patterns": [
       "How can I contact MIS?",
       "What is the contact number of MIS?",
       "Contact Information of MIS",
       "Email address of MIS",
       "facebook account of MIS",
       "Official facebook account of MIS",
       "MIS Contact number"
      ],
      "responses": [
          "Contacts^contac16"
      ],
      "context_set": ""
    },
    {
      "tag": "Registrar Office Contact",
      "database": "DepartmentContacts",
      "patterns": [
       "How can I contact Registrar Office?",
       "What is the contact number of Registrar Office?",
       "Contact Information of Registrar Office",
       "Email address of Registrar Office",
       "facebook account of Registrar Office",
       "Official facebook account of Registrar Office",
       "Registrar Office Contact number"
      ],
      "responses": [
          "Contacts^contac17"
      ],
      "context_set": ""
    },
    {
      "tag": "Accounting Office Contact",
      "database": "DepartmentContacts",
      "patterns": [
       "How can I contact Accounting Office?",
       "What is the contact number of Accounting Office?",
       "Contact Information of Accounting Office",
       "Email address of Accounting Office",
       "facebook account of Accounting Office",
       "Official facebook account of Accounting Office",
       "Accounting Office Contact number"
      ],
      "responses": [
          "Contacts^contac18"

      ],
      "context_set": ""
    },
    {
      "tag": "Scholar Office Contact",
      "database": "DepartmentContacts",
      "patterns": [
       "How can I contact Scholar Office?",
       "What is the contact number of Scholar Office?",
       "Contact Information of Scholar Office",
       "Email address of Scholar Office",
       "facebook account of Scholar Office",
       "Official facebook account of Scholar Office",
       "Scholar Office Contact number"
      ],
      "responses": [
          "Contacts^contac19"
          
      ],
      "context_set": ""
    },
    {
      "tag": "AboutDevs1",
      "patterns": [
        "Who develop you?",
        "About Developers",
        "About Developer",
        "Who Created you",
        "Who is your Creator"
      ],
      "responses": [
          "I am a capstone project that created by TInY API team. The TInY API team is lead by James Paul Nuque. The UI/UX Deisgner, Web Developer and Creator of TInY API and TInY Chatbot is Dawn Lemuel Bugay.The other members that help to contribute the research are Neil Adrian Torres, Jovito Tiglao and Shermel Sandoval."          
      ],
      "context_set": ""
    },
    {
      "tag": "AboutDevs2",
      "patterns": [
        "How can i contact your developer?",
        "How to contact your developer",
        "Contact info of your developer",
        "your developers number",
        "what is the email of your developer?",
        "Contact number of Dawn Lemuel Bugay"
      ],
      "responses": [
          "You can contact Dawn Lemuel Bugay the creator of TInY API and TInY Chatbot at Dawn.bugay@gmail.com"          
      ],
      "context_set": ""
    },
    {
      "tag": "HowToUseTinyAPi",
      "patterns": [
        "How to use tiny api",
        "tiny api documentation",
        "tiny api usages"
      ],
      "responses": [
          "To Know how to use TInY API you can check the official documentation of TInY API at TInYPI.com"          
      ],
      "context_set": ""
    },
    {
      "tag": "CourseOffer",
      "patterns": [
        "What courses BulSU offered?",
        "What courses BulSU offer?",
        "Courses offered by bulsu",
        "Course available in bulsu",
        "Courses in Bulsu",
        "course available in bulsu",
        "what course can i take in bulsu"
      ],
      "responses": [
        "You can check the course offered by BulSU at https://www.bulsu.edu.ph/academics/"
      ],
      "context_set": ""
    },{
      "tag": "SgOFfice",
      "patterns": [
        "where is the office of SG?",
        "where is the office of Student Goverment?",
        "student goverment office",
        "location of student goverment"
      ],
      "responses": [
        "The Student Goverment office is located in front of Valencia Hall."
      ],
      "context_set": ""
    },{
      "tag": "why choose bulsu",
      "patterns": [
        "why should i choose bulsu?",
        "why should i choose bulsu to study in?",
        "why should i study in bulsu?",
        "should i choose bulsu?",
        "why choose bulsu?"
      ],
      "responses": [
        "Bulacan state university is like the 'University of the Philippines in Bulacan' it is the school that has one of the tightest screening for incoming freshmen students. Students choosing this school because of its good reputation. About board exam results, BSU graduates are always on the list of top notchers. Besides the fact that the now BulSU offer free tuition to their students."
      ],
      "context_set": ""
    }
    ,{
      "tag": "thank you",
      "patterns": [
        "thank you",
        "salamat po",
        "thank you po",
        "thank you very much",
        "ty",
        "thanks"
      ],
      "responses": [
        "You're always welcome.",
        "Welcome",
        "Im glad that I helped you"
      ],
      "context_set": ""
    }
  ]
}